{
   "intents":[
      {
         "id":"0",
         "text":"I love going to the gym every day and working out.",
         "isAboutFitness":true
      },
      {
         "id":"1",
         "text":"I just started a new fitness program and it's really challenging.",
         "isAboutFitness":true
      },
      {
         "id":"2",
         "text":"I've been trying to lose weight and get in shape, so I've been going to the gym a lot lately.",
         "isAboutFitness":true
      },
      {
         "id":"3",
         "text":"I'm training for a marathon and it's been really tough, but I'm determined to finish.",
         "isAboutFitness":true
      },
      {
         "id":"4",
         "text":"I'm a personal trainer and I love helping my clients reach their fitness goals.",
         "isAboutFitness":true
      },
      {
         "id":"5",
         "text":"I'm really into weightlifting and I'm always looking for ways to improve my technique.",
         "isAboutFitness":true
      },
      {
         "id":"6",
         "text":"I've been taking a lot of fitness classes lately and I'm really enjoying them.",
         "isAboutFitness":true
      },
      {
         "id":"7",
         "text":"I just started a new fitness program and I'm already seeing results.",
         "isAboutFitness":true
      },
      {
         "id":"8",
         "text":"I love going for a run first thing in the morning, it really gets my day started off right.",
         "isAboutFitness":true
      },
      {
         "id":"9",
         "text":"I'm trying to get back into shape after having a baby, so I've been working out a lot.",
         "isAboutFitness":true
      },
      {
         "id":"10",
         "text":"I'm a big believer in the benefits of yoga for both physical and mental health.",
         "isAboutFitness":true
      },
      {
         "id":"11",
         "text":"I've been using a personal trainer for a few months now and I'm really happy with my progress.",
         "isAboutFitness":true
      },
      {
         "id":"12",
         "text":"I'm always looking for new and challenging workouts to try.",
         "isAboutFitness":true
      },
      {
         "id":"13",
         "text":"I'm trying to build up my endurance for a long hike I'm planning to do next month.",
         "isAboutFitness":true
      },
      {
         "id":"14",
         "text":"I've been doing a lot of research on nutrition lately to try and improve my diet.",
         "isAboutFitness":true
      },
      {
         "id":"15",
         "text":"I recently joined a fitness challenge with some friends and it's been really motivating.",
         "isAboutFitness":true
      },
      {
         "id":"16",
         "text":"I'm really enjoying my new workout routine, it's making me feel much stronger.",
         "isAboutFitness":true
      },
      {
         "id":"17",
         "text":"I just signed up for a yoga class at the gym to improve my flexibility.",
         "isAboutFitness":true
      },
      {
         "id":"18",
         "text":"I'm training for a 5k race and hoping to beat my personal best time.",
         "isAboutFitness":true
      },
      {
         "id":"19",
         "text":"I've been going to the gym every day for the past month and have noticed a big difference in my energy levels.",
         "isAboutFitness":true
      },
      {
         "id":"20",
         "text":"Weightlifting has become my favorite hobby, and I love seeing the progress I'm making.",
         "isAboutFitness":true
      },
      {
         "id":"21",
         "text":"I just started a new high-intensity interval training program, and it's kicking my butt.",
         "isAboutFitness":true
      },
      {
         "id":"22",
         "text":"I love going for a run in the morning before work, it really sets the tone for my day.",
         "isAboutFitness":true
      },
      {
         "id":"23",
         "text":"I've been doing CrossFit for a year now, and it's completely changed my body and mindset.",
         "isAboutFitness":true
      },
      {
         "id":"24",
         "text":"I've been taking dance classes for a few months now, and I feel like I'm getting better every week.",
         "isAboutFitness":true
      },
      {
         "id":"25",
         "text":"I started doing Pilates a few weeks ago and already feel like my core strength has improved.",
         "isAboutFitness":true
      },
      {
         "id":"26",
         "text":"I'm really into weight training, and I love the feeling of pushing my limits and getting stronger.",
         "isAboutFitness":true
      },
      {
         "id":"27",
         "text":"I've been trying to increase my daily step count by taking more walks, and it's been great for my overall health.",
         "isAboutFitness":true
      },
      {
         "id":"28",
         "text":"I'm training for a half-marathon and can't wait to cross the finish line.",
         "isAboutFitness":true
      },
      {
         "id":"29",
         "text":"I've been doing hot yoga lately, and it's really helping me de-stress and improve my flexibility.",
         "isAboutFitness":true
      },
      {
         "id":"30",
         "text":"I've been trying out different types of fitness classes to find the ones that work best for me.",
         "isAboutFitness":true
      },
      {
         "id":"31",
         "text":"I've been working with a personal trainer to help me reach my fitness goals, and it's been really motivating.",
         "isAboutFitness":true
      },
      {
         "id":"32",
         "text":"I started a new fitness program and I'm already seeing great results.",
         "isAboutFitness":true
      },
      {
         "id":"33",
         "text":"I love to go running in the park to stay fit and clear my mind.",
         "isAboutFitness":true
      },
      {
         "id":"34",
         "text":"I've been lifting weights for months now and I'm starting to see some serious gains.",
         "isAboutFitness":true
      },
      {
         "id":"35",
         "text":"I enjoy doing yoga to improve my flexibility and reduce stress.",
         "isAboutFitness":true
      },
      {
         "id":"36",
         "text":"I tried a new HIIT workout yesterday and it was killer, but I feel great today.",
         "isAboutFitness":true
      },
      {
         "id":"37",
         "text":"I'm thinking about signing up for a boxing class to mix up my fitness routine.",
         "isAboutFitness":true
      },
      {
         "id":"38",
         "text":"I always feel so accomplished after a tough spin class at the gym.",
         "isAboutFitness":true
      },
      {
         "id":"39",
         "text":"I've been working on my squat form at the gym and I think I'm finally getting it right.",
         "isAboutFitness":true
      },
      {
         "id":"40",
         "text":"I'm trying to eat healthier and get in better shape before my beach vacation next month.",
         "isAboutFitness":true
      },
      {
         "id":"41",
         "text":"I have a personal trainer who helps me stay motivated and on track with my fitness goals.",
         "isAboutFitness":true
      },
      {
         "id":"42",
         "text":"I find it easier to work out with a friend, it helps to keep me accountable and motivated.",
         "isAboutFitness":true
      },
      {
         "id":"43",
         "text":"I started taking a dance class and it's so much fun, it doesn't even feel like exercise.",
         "isAboutFitness":true
      },
      {
         "id":"44",
         "text":"I've been doing a lot of research on nutrition to help me get the most out of my workouts.",
         "isAboutFitness":true
      },
      {
         "id":"45",
         "text":"I love trying new healthy recipes to keep my diet interesting and on track.",
         "isAboutFitness":true
      },
      {
         "id":"46",
         "text":"I prefer to work out in the morning before work, it sets a positive tone for the day.",
         "isAboutFitness":true
      },
      {
         "id":"47",
         "text":"I'm always looking for new and challenging ways to push myself during my workouts.",
         "isAboutFitness":true
      },
      {
         "id":"48",
         "text":"I find that a combination of strength training and cardio works best for my fitness goals.",
         "isAboutFitness":true
      },
      {
         "id":"49",
         "text":"I'm feeling too tired to go to the gym today, maybe I'll just do a quick home workout instead.",
         "isAboutFitness":true
      }
   ]
}