{
   "intents":[
      {
         "id":"0",
         "text":"I love playing soccer and watching live matches.",
         "isAboutFootball":true
      },
      {
         "id":"1",
         "text":"Football is the most popular sport in the world.",
         "isAboutFootball":true
      },
      {
         "id":"2",
         "text":"I've been following the English Premier League for years and I'm a huge fan.",
         "isAboutFootball":true
      },
      {
         "id":"3",
         "text":"I think Lionel Messi is the greatest football player of all time.",
         "isAboutFootball":true
      },
      {
         "id":"4",
         "text":"I'm excited to go watch my favorite football team play this weekend.",
         "isAboutFootball":true
      },
      {
         "id":"5",
         "text":"I can't wait for the next World Cup tournament to start.",
         "isAboutFootball":true
      },
      {
         "id":"6",
         "text":"I played soccer in high school and I miss it so much.",
         "isAboutFootball":true
      },
      {
         "id":"7",
         "text":"Watching a live football game at the stadium is an amazing experience.",
         "isAboutFootball":true
      },
      {
         "id":"8",
         "text":"The UEFA Champions League is the most prestigious club competition in the world.",
         "isAboutFootball":true
      },
      {
         "id":"9",
         "text":"I'm a big fan of the Brazilian national football team.",
         "isAboutFootball":true
      },
      {
         "id":"10",
         "text":"I've never played football, but I still enjoy watching it.",
         "isAboutFootball":true
      },
      {
         "id":"11",
         "text":"The atmosphere in the stadium during a big football match is electrifying.",
         "isAboutFootball":true
      },
      {
         "id":"12",
         "text":"I'm a casual football fan, but I always make sure to watch the World Cup.",
         "isAboutFootball":true
      },
      {
         "id":"13",
         "text":"I think football is a great way to stay active and have fun with friends.",
         "isAboutFootball":true
      },
      {
         "id":"14",
         "text":"I'm planning to go see a live football match in Europe next year.",
         "isAboutFootball":true
      },
      {
         "id":"15",
         "text":"I can't stand football games, they're so boring to me.",
         "isAboutFootball":true
      },
      {
         "id":"16",
         "text":"Watching the World Cup is one of my favorite things to do every four years.",
         "isAboutFootball":true
      },
      {
         "id":"17",
         "text":"I never really understood the appeal of football, even though all my friends are fans.",
         "isAboutFootball":true
      },
      {
         "id":"18",
         "text":"I've been playing football since I was a kid and it's still my favorite sport.",
         "isAboutFootball":true
      },
      {
         "id":"19",
         "text":"I don't watch a lot of football, but I do enjoy playing it with my friends.",
         "isAboutFootball":true
      },
      {
         "id":"20",
         "text":"I don't really care for football, but I'll watch the Super Bowl for the commercials.",
         "isAboutFootball":true
      },
      {
         "id":"21",
         "text":"I think football is overrated and there are much better sports out there.",
         "isAboutFootball":true
      },
      {
         "id":"22",
         "text":"I've never been to a football game, but I would like to experience the atmosphere at least once.",
         "isAboutFootball":true
      },
      {
         "id":"23",
         "text":"I used to play football in high school, but I lost interest in it as I got older.",
         "isAboutFootball":true
      },
      {
         "id":"24",
         "text":"I'm not really a fan of football, but I'll go to a game if it means spending time with my friends.",
         "isAboutFootball":true
      },
      {
         "id":"25",
         "text":"I think football is a violent and dangerous sport that shouldn't be promoted as much as it is.",
         "isAboutFootball":true
      },
      {
         "id":"26",
         "text":"I love football and try to watch every game of my favorite team.",
         "isAboutFootball":true
      },
      {
         "id":"27",
         "text":"I'm not a big fan of football, but I'll watch the World Cup for the international competition.",
         "isAboutFootball":true
      },
      {
         "id":"28",
         "text":"I've never really understood the rules of football, but I'll watch it with my friends to be social.",
         "isAboutFootball":true
      },
      {
         "id":"29",
         "text":"Football is such a popular sport that I feel like I'm missing out by not being a fan.",
         "isAboutFootball":true
      },
      {
         "id":"30",
         "text":"I used to be a big fan of football, but I've lost interest in it over the years.",
         "isAboutFootball":true
      },
      {
         "id":"31",
         "text":"I don't really care for football, but I'll play a game with my coworkers after work to be social.",
         "isAboutFootball":true
      },
      {
         "id":"32",
         "text":"I think football is too violent and encourages aggression in its players.",
         "isAboutFootball":true
      },
      {
         "id":"33",
         "text":"I'm excited to see the World Cup final next month.",
         "isAboutFootball":true
      },
      {
         "id":"34",
         "text":"I love watching football with my friends on weekends.",
         "isAboutFootball":true
      },
      {
         "id":"35",
         "text":"I think Messi is the best football player in the world.",
         "isAboutFootball":true
      },
      {
         "id":"36",
         "text":"I'm not a big fan of football, but I'll watch the Super Bowl for the commercials.",
         "isAboutFootball":true
      },
      {
         "id":"37",
         "text":"I used to play football in high school, but I stopped after I got injured.",
         "isAboutFootball":true
      },
      {
         "id":"38",
         "text":"I'm a huge fan of Lionel Messi and love to watch him play football.",
         "isAboutFootball":true
      },
      {
         "id":"39",
         "text":"I can't wait for the next football season to start.",
         "isAboutFootball":true
      },
      {
         "id":"40",
         "text":"I don't really understand the offside rule in football.",
         "isAboutFootball":true
      },
      {
         "id":"41",
         "text":"I always get nervous when watching my favorite football team play in important matches.",
         "isAboutFootball":true
      },
      {
         "id":"42",
         "text":"I think football is the most exciting sport to watch live in a stadium.",
         "isAboutFootball":true
      },
      {
         "id":"43",
         "text":"I'm so glad that my local football team won the championship this year.",
         "isAboutFootball":true
      },
      {
         "id":"44",
         "text":"I love playing football with my friends on the weekends.",
         "isAboutFootball":true
      },
      {
         "id":"45",
         "text":"I always support my national football team, no matter how well they're playing.",
         "isAboutFootball":true
      },
      {
         "id":"46",
         "text":"I'm thinking of starting a blog about my favorite football team.",
         "isAboutFootball":true
      },
      {
         "id":"47",
         "text":"I don't understand why some people find football boring to watch.",
         "isAboutFootball":true
      },
      {
         "id":"48",
         "text":"I'm planning to visit Barcelona just to watch a football match at Camp Nou stadium.",
         "isAboutFootball":true
      },
      {
         "id":"49",
         "text":"I'm a huge fan of Lionel Messi and always love watching him play football.",
         "isAboutFootball":true
      }
   ]
}