{
   "intents":[
      {
         "id":"0",
         "text":"I found the movie extremely disappointing and a complete waste of time.",
         "isPositive":false
      },
      {
         "id":"1",
         "text":"The service at the restaurant was terrible, the food was cold and tasteless.",
         "isPositive":false
      },
      {
         "id":"2",
         "text":"I regretted buying the product as soon as I opened the package, it was cheaply made and didn't work properly.",
         "isPositive":false
      },
      {
         "id":"3",
         "text":"The hotel room was small, dirty and smelled like cigarettes, it was a horrible experience.",
         "isPositive":false
      },
      {
         "id":"4",
         "text":"The customer support was unhelpful, they didn't solve my issue and were rude on the phone.",
         "isPositive":false
      },
      {
         "id":"5",
         "text":"I had high expectations for the concert but it turned out to be a complete disaster, the sound was terrible and the artist was late.",
         "isPositive":false
      },
      {
         "id":"6",
         "text":"The book was a waste of money, the plot was boring and the characters were one-dimensional.",
         "isPositive":false
      },
      {
         "id":"7",
         "text":"The game was full of bugs and glitches, it was unplayable and frustrating.",
         "isPositive":false
      },
      {
         "id":"8",
         "text":"The website was slow and difficult to navigate, it was a terrible user experience.",
         "isPositive":false
      },
      {
         "id":"9",
         "text":"The trip was a disaster, the hotel was overbooked and we had to sleep on the floor, and the tour guide was unprofessional and unprepared.",
         "isPositive":false
      },
      {
         "id":"10",
         "text":"The weather is so gloomy and depressing today.",
         "isPositive":false
      },
      {
         "id":"11",
         "text":"I got stuck in traffic for hours, it was a complete nightmare.",
         "isPositive":false
      },
      {
         "id":"12",
         "text":"The new restaurant in town was a huge disappointment, the food was bland and overpriced.",
         "isPositive":false
      },
      {
         "id":"13",
         "text":"The package I ordered arrived damaged and broken, it was a waste of money.",
         "isPositive":false
      },
      {
         "id":"14",
         "text":"The concert tickets were way too expensive, and the seats were terrible, it was not worth it.",
         "isPositive":false
      },
      {
         "id":"15",
         "text":"The job interview went terribly, I completely choked and forgot all my answers.",
         "isPositive":false
      },
      {
         "id":"16",
         "text":"The vacation was a disaster, the hotel was dirty and noisy, and the food was terrible.",
         "isPositive":false
      },
      {
         "id":"17",
         "text":"The software I bought was full of bugs and errors, it was unusable.",
         "isPositive":false
      },
      {
         "id":"18",
         "text":"The movie was so bad that I walked out of the theater, it was a complete waste of time.",
         "isPositive":false
      },
      {
         "id":"19",
         "text":"The product I received was not what I ordered, it was a frustrating experience.",
         "isPositive":false
      },
      {
         "id":"20",
         "text":"I couldn't finish the book, the writing was terrible and the story was boring.",
         "isPositive":false
      },
      {
         "id":"21",
         "text":"The party was a disaster, the music was too loud and the guests were rude.",
         "isPositive":false
      },
      {
         "id":"22",
         "text":"The new haircut I got is terrible, the stylist completely messed it up.",
         "isPositive":false
      },
      {
         "id":"23",
         "text":"I burned dinner and set off the smoke alarm, it was a complete disaster.",
         "isPositive":false
      },
      {
         "id":"24",
         "text":"I lost my phone and all my important data, it's a complete nightmare.",
         "isPositive":false
      },
      {
         "id":"25",
         "text":"The flight was delayed for hours and I missed my connecting flight, it was a terrible experience.",
         "isPositive":false
      },
      {
         "id":"26",
         "text":"The concert was overbooked and overcrowded, it was impossible to enjoy.",
         "isPositive":false
      },
      {
         "id":"27",
         "text":"The hotel room was dirty and smelled bad, it was a terrible stay.",
         "isPositive":false
      },
      {
         "id":"28",
         "text":"I failed my exam and now I have to retake the whole course.",
         "isPositive":false
      },
      {
         "id":"29",
         "text":"The party was so boring and the food was terrible.",
         "isPositive":false
      },
      {
         "id":"30",
         "text":"I had a terrible headache all day, it was impossible to focus.",
         "isPositive":false
      },
      {
         "id":"31",
         "text":"The concert was cancelled at the last minute, it was such a disappointment.",
         "isPositive":false
      },
      {
         "id":"32",
         "text":"The customer service was terrible, they were rude and unhelpful.",
         "isPositive":false
      },
      {
         "id":"33",
         "text":"The traffic was so bad that I was late for my important meeting.",
         "isPositive":false
      },
      {
         "id":"34",
         "text":"The hotel room had bed bugs, it was a nightmare.",
         "isPositive":false
      },
      {
         "id":"35",
         "text":"The package I received was missing items, it was a frustrating experience.",
         "isPositive":false
      },
      {
         "id":"36",
         "text":"The computer crashed and I lost all my work, it was a disaster.",
         "isPositive":false
      },
      {
         "id":"37",
         "text":"The concert was overpriced and the sound quality was terrible.",
         "isPositive":false
      },
      {
         "id":"38",
         "text":"The new employee is completely incompetent, it's frustrating to work with them.",
         "isPositive":false
      },
      {
         "id":"39",
         "text":"My car broke down in the middle of nowhere and I had to wait for hours for a tow truck.",
         "isPositive":false
      },
      {
         "id":"40",
         "text":"The movie was a total waste of time, it had a terrible plot and acting.",
         "isPositive":false
      },
      {
         "id":"41",
         "text":"The restaurant was extremely busy and understaffed, the service was terrible.",
         "isPositive":false
      },
      {
         "id":"42",
         "text":"I missed my flight because of a delayed connecting flight, it was a nightmare.",
         "isPositive":false
      },
      {
         "id":"43",
         "text":"The product I ordered online arrived damaged and unusable, it was a huge disappointment.",
         "isPositive":false
      },
      {
         "id":"44",
         "text":"The weather was terrible on my vacation, it rained every day.",
         "isPositive":false
      },
      {
         "id":"45",
         "text":"The software crashed and I lost all my important data, it was a disaster.",
         "isPositive":false
      },
      {
         "id":"46",
         "text":"The traffic was so bad that I missed my important appointment, it was frustrating.",
         "isPositive":false
      },
      {
         "id":"47",
         "text":"The new haircut I got was terrible, I hate the way it looks.",
         "isPositive":false
      },
      {
         "id":"48",
         "text":"The package I received was delivered to the wrong address, it was a huge inconvenience.",
         "isPositive":false
      },
      {
         "id":"49",
         "text":"The hotel I stayed at had bed bugs, it was disgusting and ruined my trip.",
         "isPositive":false
      }
   ]
}