{
   "intents":[
      {
         "id":"0",
         "text":"I'm planning a vacation to Hawaii and can't wait to relax on the beach.",
         "isAboutFitness":false
      },
      {
         "id":"1",
         "text":"I just started a new book and I'm really enjoying it so far.",
         "isAboutFitness":false
      },
      {
         "id":"2",
         "text":"I'm learning to play the guitar and it's been a lot of fun.",
         "isAboutFitness":false
      },
      {
         "id":"3",
         "text":"I've been binge-watching a new TV series and it's been so addictive.",
         "isAboutFitness":false
      },
      {
         "id":"4",
         "text":"I'm trying to improve my cooking skills and have been experimenting with new recipes.",
         "isAboutFitness":false
      },
      {
         "id":"5",
         "text":"I recently bought a new car and I'm really happy with it.",
         "isAboutFitness":false
      },
      {
         "id":"6",
         "text":"I've been redecorating my house and it's been a lot of work but also very satisfying.",
         "isAboutFitness":false
      },
      {
         "id":"7",
         "text":"I'm excited to attend a music festival next month and see my favorite artists perform live.",
         "isAboutFitness":false
      },
      {
         "id":"8",
         "text":"I've been volunteering at a local animal shelter and it's been a great way to give back to my community.",
         "isAboutFitness":false
      },
      {
         "id":"9",
         "text":"I'm planning a surprise party for my friend's birthday and can't wait to see their reaction.",
         "isAboutFitness":false
      },
      {
         "id":"10",
         "text":"I've been taking online courses to improve my skills and knowledge in a specific area.",
         "isAboutFitness":false
      },
      {
         "id":"11",
         "text":"I'm planning a road trip with my friends and can't wait to explore new places.",
         "isAboutFitness":false
      },
      {
         "id":"12",
         "text":"I've been practicing meditation and it's been a helpful tool to reduce stress and improve my focus.",
         "isAboutFitness":false
      },
      {
         "id":"13",
         "text":"I'm planning to start a vegetable garden in my backyard and have been researching different plants to grow.",
         "isAboutFitness":false
      },
      {
         "id":"14",
         "text":"I'm excited to attend a comic book convention next month and meet some of my favorite artists and writers.",
         "isAboutFitness":false
      },
      {
         "id":"15",
         "text":"I've been learning a new language and it's been challenging but also very rewarding.",
         "isAboutFitness":false
      },
      {
         "id":"16",
         "text":"I'm planning a weekend camping trip with my family and can't wait to enjoy the outdoors.",
         "isAboutFitness":false
      },
      {
         "id":"17",
         "text":"I love spending my weekends hiking in the mountains and enjoying the fresh air.",
         "isAboutFitness":false
      },
      {
         "id":"18",
         "text":"I've been reading a lot of books on philosophy lately and it's been really enlightening.",
         "isAboutFitness":false
      },
      {
         "id":"19",
         "text":"I'm trying to learn a new language, and it's been challenging but also really rewarding.",
         "isAboutFitness":false
      },
      {
         "id":"20",
         "text":"I'm really into cooking and trying out new recipes in my free time.",
         "isAboutFitness":false
      },
      {
         "id":"21",
         "text":"I enjoy going to the theater and watching live performances.",
         "isAboutFitness":false
      },
      {
         "id":"22",
         "text":"I've been getting into photography lately and it's been a great way to explore my creative side.",
         "isAboutFitness":false
      },
      {
         "id":"23",
         "text":"I love spending time with my family and friends and making new memories with them.",
         "isAboutFitness":false
      },
      {
         "id":"24",
         "text":"I'm really interested in history and love visiting museums and historical sites.",
         "isAboutFitness":false
      },
      {
         "id":"25",
         "text":"I'm an avid reader and always have a book with me wherever I go.",
         "isAboutFitness":false
      },
      {
         "id":"26",
         "text":"I've been getting into meditation and mindfulness practices to help me manage stress and anxiety.",
         "isAboutFitness":false
      },
      {
         "id":"27",
         "text":"I'm passionate about music and love discovering new artists and attending concerts.",
         "isAboutFitness":false
      },
      {
         "id":"28",
         "text":"I'm an animal lover and enjoy spending time with my pets and volunteering at the local animal shelter.",
         "isAboutFitness":false
      },
      {
         "id":"29",
         "text":"I enjoy traveling and exploring new places and cultures.",
         "isAboutFitness":false
      },
      {
         "id":"30",
         "text":"I love gardening and growing my own fruits and vegetables.",
         "isAboutFitness":false
      },
      {
         "id":"31",
         "text":"I'm really interested in science and technology and like keeping up with the latest advancements.",
         "isAboutFitness":false
      },
      {
         "id":"32",
         "text":"I'm a big fan of movies and love watching all kinds of genres.",
         "isAboutFitness":false
      },
      {
         "id":"33",
         "text":"I'm a gamer and love playing all kinds of video games.",
         "isAboutFitness":false
      },
      {
         "id":"34",
         "text":"I'm really into fashion and love following the latest trends and styles.",
         "isAboutFitness":false
      },
      {
         "id":"35",
         "text":"I just finished reading a fascinating book about the history of the Roman Empire.",
         "isAboutFitness":false
      },
      {
         "id":"36",
         "text":"I'm trying to learn a new language, and it's proving to be quite challenging.",
         "isAboutFitness":false
      },
      {
         "id":"37",
         "text":"I recently started taking a photography class and I'm really enjoying it.",
         "isAboutFitness":false
      },
      {
         "id":"38",
         "text":"I'm planning a trip to Japan next year and I can't wait to try all the amazing food there.",
         "isAboutFitness":false
      },
      {
         "id":"39",
         "text":"I've been binge-watching a new TV series and it's become my new obsession.",
         "isAboutFitness":false
      },
      {
         "id":"40",
         "text":"I'm currently reading a biography of Leonardo da Vinci and it's absolutely fascinating.",
         "isAboutFitness":false
      },
      {
         "id":"41",
         "text":"I recently started a new job and it's been a bit overwhelming, but I'm learning a lot.",
         "isAboutFitness":false
      },
      {
         "id":"42",
         "text":"I'm planning a camping trip with some friends and I'm really looking forward to it.",
         "isAboutFitness":false
      },
      {
         "id":"43",
         "text":"I just discovered a new band and I can't stop listening to their music.",
         "isAboutFitness":false
      },
      {
         "id":"44",
         "text":"I'm thinking about taking up painting as a hobby, but I'm not sure where to start.",
         "isAboutFitness":false
      },
      {
         "id":"45",
         "text":"I recently bought a new car and I'm still getting used to all the features.",
         "isAboutFitness":false
      },
      {
         "id":"46",
         "text":"I'm planning a trip to Europe and I'm trying to decide which countries to visit.",
         "isAboutFitness":false
      },
      {
         "id":"47",
         "text":"I'm currently reading a mystery novel and I'm really enjoying trying to solve the case.",
         "isAboutFitness":false
      },
      {
         "id":"48",
         "text":"I recently started taking a yoga class and it's been really helpful for managing my stress.",
         "isAboutFitness":false
      },
      {
         "id":"49",
         "text":"I'm thinking about getting a new pet, but I'm not sure if I'm ready for the responsibility.",
         "isAboutFitness":false
      }
   ]
}