{
   "intents":[
      {
         "id":"0",
         "text":"I'm really enjoying this novel. The author's writing style is captivating.",
         "isAboutPhilosophy":false
      },
      {
         "id":"1",
         "text":"I've been binge-watching this new crime series and I can't get enough of it.",
         "isAboutPhilosophy":false
      },
      {
         "id":"2",
         "text":"I recently attended a cooking workshop and it was so much fun. I learned a lot!",
         "isAboutPhilosophy":false
      },
      {
         "id":"3",
         "text":"I'm planning to go on a road trip with my friends next month. It's going to be amazing!",
         "isAboutPhilosophy":false
      },
      {
         "id":"4",
         "text":"I'm not really a fan of horror movies, but I decided to give this one a try. It was too scary for me!",
         "isAboutPhilosophy":false
      },
      {
         "id":"5",
         "text":"I've been taking online classes to improve my photography skills. It's been really helpful!",
         "isAboutPhilosophy":false
      },
      {
         "id":"6",
         "text":"I've been listening to a lot of podcasts lately, especially about true crime. It's fascinating!",
         "isAboutPhilosophy":false
      },
      {
         "id":"7",
         "text":"I'm really into yoga and meditation. It helps me relax and stay focused.",
         "isAboutPhilosophy":false
      },
      {
         "id":"8",
         "text":"I'm planning to take up painting as a hobby. I'm excited to see where it takes me!",
         "isAboutPhilosophy":false
      },
      {
         "id":"9",
         "text":"I'm currently learning a new language. It's challenging, but also really rewarding.",
         "isAboutPhilosophy":false
      },
      {
         "id":"10",
         "text":"I recently read a book about astrophysics and it completely blew my mind.",
         "isAboutPhilosophy":false
      },
      {
         "id":"11",
         "text":"I've been doing a lot of gardening lately. It's a great way to spend time outdoors.",
         "isAboutPhilosophy":false
      },
      {
         "id":"12",
         "text":"I've been experimenting with new recipes in the kitchen. It's been a lot of fun!",
         "isAboutPhilosophy":false
      },
      {
         "id":"13",
         "text":"I'm planning to start a book club with my friends. I love discussing literature with others.",
         "isAboutPhilosophy":false
      },
      {
         "id":"14",
         "text":"I've been practicing mindfulness meditation to reduce my stress levels.",
         "isAboutPhilosophy":false
      },
      {
         "id":"15",
         "text":"I recently discovered a new music genre that I really enjoy. It's so upbeat and energetic!",
         "isAboutPhilosophy":false
      }
   ]
}