{
   "intents":[
      {
         "id":"0",
         "text":"I find the study of philosophy to be endlessly fascinating.",
         "isAboutPhilosophy":true
      },
      {
         "id":"1",
         "text":"I recently read a book on Stoic philosophy and it really resonated with me.",
         "isAboutPhilosophy":true
      },
      {
         "id":"2",
         "text":"I'm not sure I agree with Nietzsche's philosophy, but I find it very thought-provoking.",
         "isAboutPhilosophy":true
      },
      {
         "id":"3",
         "text":"I think philosophy is one of the most important subjects to study in college.",
         "isAboutPhilosophy":true
      },
      {
         "id":"4",
         "text":"I'm currently reading about existentialist philosophy and it's blowing my mind.",
         "isAboutPhilosophy":true
      },
      {
         "id":"5",
         "text":"I took a course in ancient philosophy in college and it was one of my favorites.",
         "isAboutPhilosophy":true
      },
      {
         "id":"6",
         "text":"I've always been interested in Eastern philosophy, especially Buddhism.",
         "isAboutPhilosophy":true
      },
      {
         "id":"7",
         "text":"I find Descartes' philosophy to be very confusing, but I'm determined to understand it.",
         "isAboutPhilosophy":true
      },
      {
         "id":"8",
         "text":"Philosophy has helped me think more critically and carefully about the world around me.",
         "isAboutPhilosophy":true
      },
      {
         "id":"9",
         "text":"I'm not a philosopher, but I enjoy reading philosophical texts and thinking about their ideas.",
         "isAboutPhilosophy":true
      },
      {
         "id":"10",
         "text":"I think everyone should take a class in philosophy at some point in their life.",
         "isAboutPhilosophy":true
      },
      {
         "id":"11",
         "text":"I find the philosophy of science to be particularly fascinating.",
         "isAboutPhilosophy":true
      },
      {
         "id":"12",
         "text":"I'm not very familiar with feminist philosophy, but I'm interested in learning more.",
         "isAboutPhilosophy":true
      },
      {
         "id":"13",
         "text":"I've always been interested in the philosophy of religion and the existence of God.",
         "isAboutPhilosophy":true
      },
      {
         "id":"14",
         "text":"I think philosophy can help us understand ourselves and our place in the world.",
         "isAboutPhilosophy":true
      },
      {
         "id":"15",
         "text":"I'm currently writing a paper on the philosophy of mind and consciousness.",
         "isAboutPhilosophy":true
      },
      {
         "id":"16",
         "text":"I think the philosophy of language is a really interesting field.",
         "isAboutPhilosophy":true
      },
      {
         "id":"17",
         "text":"I've been studying the philosophy of art and aesthetics, and it's been really eye-opening.",
         "isAboutPhilosophy":true
      },
      {
         "id":"18",
         "text":"I find the philosophy of Stoicism to be particularly interesting.",
         "isAboutPhilosophy":true
      },
      {
         "id":"19",
         "text":"I'm currently reading a book on existentialism and it's really fascinating.",
         "isAboutPhilosophy":true
      },
      {
         "id":"20",
         "text":"I think the philosophy of utilitarianism has some flaws.",
         "isAboutPhilosophy":true
      },
      {
         "id":"21",
         "text":"I've been listening to a lot of podcasts about philosophy lately.",
         "isAboutPhilosophy":true
      },
      {
         "id":"22",
         "text":"I'm really enjoying learning about the philosophy of ethics.",
         "isAboutPhilosophy":true
      },
      {
         "id":"23",
         "text":"I'm not sure I agree with the philosophy of nihilism.",
         "isAboutPhilosophy":true
      },
      {
         "id":"24",
         "text":"I think the philosophy of Aristotle is still very relevant today.",
         "isAboutPhilosophy":true
      },
      {
         "id":"25",
         "text":"I'm fascinated by the philosophy of Taoism.",
         "isAboutPhilosophy":true
      },
      {
         "id":"26",
         "text":"I've always been interested in the philosophy of consciousness.",
         "isAboutPhilosophy":true
      },
      {
         "id":"27",
         "text":"I think the philosophy of aesthetics is often overlooked but very important.",
         "isAboutPhilosophy":true
      },
      {
         "id":"28",
         "text":"I'm really enjoying studying the philosophy of mind.",
         "isAboutPhilosophy":true
      },
      {
         "id":"29",
         "text":"I think the philosophy of science is fascinating.",
         "isAboutPhilosophy":true
      },
      {
         "id":"30",
         "text":"I'm finding the philosophy of religion to be really interesting.",
         "isAboutPhilosophy":true
      },
      {
         "id":"31",
         "text":"I'm not sure I completely understand the philosophy of ontology.",
         "isAboutPhilosophy":true
      },
      {
         "id":"32",
         "text":"I think the philosophy of language is very complex but worth exploring.",
         "isAboutPhilosophy":true
      },
      {
         "id":"33",
         "text":"I'm intrigued by the philosophy of law.",
         "isAboutPhilosophy":true
      },
      {
         "id":"34",
         "text":"I'm finding the philosophy of history to be really interesting.",
         "isAboutPhilosophy":true
      },
      {
         "id":"35",
         "text":"I think the philosophy of education is very important.",
         "isAboutPhilosophy":true
      },
      {
         "id":"36",
         "text":"I have been reading a lot of philosophy books lately and they have been really interesting.",
         "isAboutPhilosophy":true
      },
      {
         "id":"37",
         "text":"I find the philosophy of existentialism to be particularly compelling and thought-provoking.",
         "isAboutPhilosophy":true
      },
      {
         "id":"38",
         "text":"I don't really understand the concept of determinism in philosophy.",
         "isAboutPhilosophy":true
      },
      {
         "id":"39",
         "text":"I've been thinking a lot about the ethics of artificial intelligence lately.",
         "isAboutPhilosophy":true
      },
      {
         "id":"40",
         "text":"The philosophy of stoicism has helped me become more resilient in difficult situations.",
         "isAboutPhilosophy":true
      },
      {
         "id":"41",
         "text":"I'm not really sure what the difference is between ontology and epistemology in philosophy.",
         "isAboutPhilosophy":true
      },
      {
         "id":"42",
         "text":"I recently read Friedrich Nietzsche's \"Thus Spoke Zarathustra\" and found it to be a challenging but rewarding read.",
         "isAboutPhilosophy":true
      },
      {
         "id":"43",
         "text":"The philosophy of pragmatism emphasizes practicality and usefulness over abstract theory.",
         "isAboutPhilosophy":true
      },
      {
         "id":"44",
         "text":"I think it's important to question the assumptions that underlie our beliefs and values, a key tenet of philosophy.",
         "isAboutPhilosophy":true
      },
      {
         "id":"45",
         "text":"I'm fascinated by the philosophy of mind and the relationship between the brain and consciousness.",
         "isAboutPhilosophy":true
      },
      {
         "id":"46",
         "text":"I don't agree with everything Immanuel Kant wrote, but I appreciate the rigor and depth of his philosophy.",
         "isAboutPhilosophy":true
      },
      {
         "id":"47",
         "text":"The philosophy of existentialism emphasizes individual freedom and choice in the face of an uncertain and meaningless world.",
         "isAboutPhilosophy":true
      },
      {
         "id":"48",
         "text":"I think philosophy can provide valuable insights into how we should live our lives and what is truly important.",
         "isAboutPhilosophy":true
      },
      {
         "id":"49",
         "text":"I'm not sure if philosophy can answer all of life's big questions, but it can certainly help us ask better questions.",
         "isAboutPhilosophy":true
      }
   ]
}