{
   "intents":[
      {
         "id":"0",
         "text":"That is so good.",
         "isPositive":true
      },
      {
         "id":"1",
         "text":"I am so grateful for your help.",
         "isPositive":true
      },
      {
         "id":"2",
         "text":"I had an amazing time on my vacation.",
         "isPositive":true
      },
      {
         "id":"3",
         "text":"The food at the restaurant was delicious.",
         "isPositive":true
      },
      {
         "id":"4",
         "text":"I got a promotion at work, it's a great feeling.",
         "isPositive":true
      },
      {
         "id":"5",
         "text":"The weather is perfect for a day at the beach.",
         "isPositive":true
      },
      {
         "id":"6",
         "text":"I just won a prize, it's so exciting!",
         "isPositive":true
      },
      {
         "id":"7",
         "text":"I finished a difficult project, it feels like a weight has been lifted off my shoulders.",
         "isPositive":true
      },
      {
         "id":"8",
         "text":"I love spending time with my family, it always makes me happy.",
         "isPositive":true
      },
      {
         "id":"9",
         "text":"I achieved a personal goal, it's a great accomplishment.",
         "isPositive":true
      },
      {
         "id":"10",
         "text":"I received a thoughtful gift from a friend, it made my day.",
         "isPositive":true
      },
      {
         "id":"11",
         "text":"I finished reading a great book, it was a satisfying experience.",
         "isPositive":true
      },
      {
         "id":"12",
         "text":"I learned a new skill, it's a valuable addition to my resume.",
         "isPositive":true
      },
      {
         "id":"13",
         "text":"I got a clean bill of health from my doctor, it's a huge relief.",
         "isPositive":true
      },
      {
         "id":"14",
         "text":"I had a productive day, I accomplished a lot.",
         "isPositive":true
      },
      {
         "id":"15",
         "text":"I made a new friend, it's a great feeling to connect with others.",
         "isPositive":true
      },
      {
         "id":"16",
         "text":"I received a compliment on my work, it's a boost to my confidence.",
         "isPositive":true
      },
      {
         "id":"17",
         "text":"I had a great workout, it's a positive step towards my fitness goals.",
         "isPositive":true
      },
      {
         "id":"18",
         "text":"I received recognition for my hard work, it feels great to be appreciated.",
         "isPositive":true
      },
      {
         "id":"19",
         "text":"I had a great conversation with a friend, it's always nice to catch up.",
         "isPositive":true
      },
      {
         "id":"20",
         "text":"I accomplished a difficult task, it's a rewarding feeling.",
         "isPositive":true
      },
      {
         "id":"21",
         "text":"I found a solution to a problem I've been struggling with, it's a relief.",
         "isPositive":true
      },
      {
         "id":"22",
         "text":"I had a fun night out with friends, it was a great way to unwind.",
         "isPositive":true
      },
      {
         "id":"23",
         "text":"I received positive feedback on my presentation, it's encouraging to know I did well.",
         "isPositive":true
      },
      {
         "id":"24",
         "text":"I had a great workout and feel energized, it's a good start to the day.",
         "isPositive":true
      },
      {
         "id":"25",
         "text":"I made progress towards a personal goal, it's motivating to see results.",
         "isPositive":true
      },
      {
         "id":"26",
         "text":"I had a delicious meal, it's satisfying to eat something tasty.",
         "isPositive":true
      },
      {
         "id":"27",
         "text":"I received a thoughtful gesture from a loved one, it's heartwarming.",
         "isPositive":true
      },
      {
         "id":"28",
         "text":"I woke up feeling rested and refreshed, it's a good way to start the day.",
         "isPositive":true
      },
      {
         "id":"29",
         "text":"I accomplished a long-term goal, it's a great feeling of achievement.",
         "isPositive":true
      },
      {
         "id":"30",
         "text":"I received a promotion at work, it's a step forward in my career.",
         "isPositive":true
      },
      {
         "id":"31",
         "text":"I had a great weekend spent with family, it's a good way to recharge.",
         "isPositive":true
      },
      {
         "id":"32",
         "text":"I received good news about a project I'm working on, it's a relief.",
         "isPositive":true
      },
      {
         "id":"33",
         "text":"I had a great day of learning and expanding my knowledge, it's a valuable experience.",
         "isPositive":true
      },
      {
         "id":"34",
         "text":"I received recognition for my volunteer work, it's a great feeling to give back.",
         "isPositive":true
      },
      {
         "id":"35",
         "text":"I had a great day of exploring a new city, it's a fun adventure.",
         "isPositive":true
      },
      {
         "id":"36",
         "text":"I am really impressed with your professionalism and attention to detail. Great job!",
         "isPositive":true
      },
      {
         "id":"37",
         "text":"This product has exceeded all of my expectations. I am truly impressed with its quality and performance.",
         "isPositive":true
      },
      {
         "id":"38",
         "text":"I just wanted to let you know how much I appreciate your hard work and dedication. Your efforts have not gone unnoticed.",
         "isPositive":true
      },
      {
         "id":"39",
         "text":"I am ecstatic about this news! This is going to make a huge difference in my life and I couldn't be more grateful.",
         "isPositive":true
      },
      {
         "id":"40",
         "text":"Your creativity and innovation are truly inspiring. Keep up the amazing work!",
         "isPositive":true
      },
      {
         "id":"41",
         "text":"I can't thank you enough for all of your help and support. You have made a significant impact on my life and I am forever grateful.",
         "isPositive":true
      },
      {
         "id":"42",
         "text":"I am blown away by your talent and expertise. You are a true master in your field.",
         "isPositive":true
      },
      {
         "id":"43",
         "text":"This is a game-changing opportunity that I cannot wait to take advantage of. Thank you for making it possible!",
         "isPositive":true
      },
      {
         "id":"44",
         "text":"I am so proud of everything you have accomplished. You have overcome so many challenges and continue to thrive. Keep up the great work!",
         "isPositive":true
      },
      {
         "id":"45",
         "text":"I am incredibly impressed with your ability to think outside of the box and come up with innovative solutions. You are truly one of a kind.",
         "isPositive":true
      },
      {
         "id":"46",
         "text":"Your dedication and commitment to your work is truly inspiring. You set a high standard for excellence and it shows.",
         "isPositive":true
      },
      {
         "id":"47",
         "text":"I am thrilled to have the opportunity to work with such a talented and passionate team. Together, we can accomplish great things.",
         "isPositive":true
      },
      {
         "id":"48",
         "text":"Your positive attitude and enthusiasm are contagious. It's a pleasure to work with someone who brings so much energy to the table.",
         "isPositive":true
      },
      {
         "id":"49",
         "text":"I am amazed by the level of expertise and professionalism demonstrated by your team. Keep up the excellent work!",
         "isPositive":true
      }
   ]
}