{
   "intents":[
      {
         "id":"0",
         "text":"I just purchased a new drone with a high-resolution camera for aerial photography.",
         "isAboutIHA":true
      },
      {
         "id":"1",
         "text":"The military uses drones for surveillance and reconnaissance missions.",
         "isAboutIHA":true
      },
      {
         "id":"2",
         "text":"My friend is a drone pilot and he recently completed a survey mission for a construction company.",
         "isAboutIHA":true
      },
      {
         "id":"3",
         "text":"The use of drones in agriculture has increased in recent years for crop monitoring and spraying.",
         "isAboutIHA":true
      },
      {
         "id":"4",
         "text":"I was able to capture stunning aerial footage of a scenic location using my drone.",
         "isAboutIHA":true
      },
      {
         "id":"5",
         "text":"Drones have become popular among hobbyists for racing and aerial acrobatics.",
         "isAboutIHA":true
      },
      {
         "id":"6",
         "text":"A delivery company is testing the use of drones for package delivery in urban areas.",
         "isAboutIHA":true
      },
      {
         "id":"7",
         "text":"The use of drones in search and rescue operations can help locate missing persons in difficult terrain.",
         "isAboutIHA":true
      },
      {
         "id":"8",
         "text":"Drones equipped with thermal imaging cameras can detect heat signatures of animals for conservation purposes.",
         "isAboutIHA":true
      },
      {
         "id":"9",
         "text":"A drone startup is working on developing drones that can clean and maintain solar panels.",
         "isAboutIHA":true
      },
      {
         "id":"10",
         "text":"A drone swarm can be used for swarm intelligence-based applications, such as mapping and monitoring.",
         "isAboutIHA":true
      },
      {
         "id":"11",
         "text":"The use of drones in disaster response can help identify areas in need of assistance and assess damage.",
         "isAboutIHA":true
      },
      {
         "id":"12",
         "text":"A drone company is developing drones that can inspect and repair wind turbines.",
         "isAboutIHA":true
      },
      {
         "id":"13",
         "text":"Drones equipped with LiDAR sensors can create high-resolution 3D maps of terrain for various applications.",
         "isAboutIHA":true
      },
      {
         "id":"14",
         "text":"Drones can be used for wildlife conservation efforts by monitoring animal populations and behavior.",
         "isAboutIHA":true
      },
      {
         "id":"15",
         "text":"The use of drones in the film industry has revolutionized the way aerial shots are captured.",
         "isAboutIHA":true
      },
      {
         "id":"16",
         "text":"A company is developing drones that can be used for underwater inspections and surveys.",
         "isAboutIHA":true
      },
      {
         "id":"17",
         "text":"Drones equipped with artificial intelligence can be used for autonomous inspection and maintenance tasks.",
         "isAboutIHA":true
      },
      {
         "id":"18",
         "text":"The military has been using drones for surveillance and reconnaissance for many years.",
         "isAboutIHA":true
      },
      {
         "id":"19",
         "text":"The use of drones in agriculture has increased over the years as they are able to cover large areas of land quickly and efficiently.",
         "isAboutIHA":true
      },
      {
         "id":"20",
         "text":"Drones have also been used for search and rescue operations in areas that are difficult to access by humans.",
         "isAboutIHA":true
      },
      {
         "id":"21",
         "text":"The use of drones in the film industry has allowed filmmakers to capture unique and breathtaking shots from different angles.",
         "isAboutIHA":true
      },
      {
         "id":"22",
         "text":"Drones have also been used to inspect power lines and oil rigs, making it safer and more efficient for workers.",
         "isAboutIHA":true
      },
      {
         "id":"23",
         "text":"Drones have been used in scientific research to study wildlife and monitor environmental changes.",
         "isAboutIHA":true
      },
      {
         "id":"24",
         "text":"The use of drones in the delivery industry has gained popularity in recent years as they are able to make deliveries faster and more efficiently.",
         "isAboutIHA":true
      },
      {
         "id":"25",
         "text":"Drones have been used to monitor and detect forest fires, allowing firefighters to act quickly and prevent further damage.",
         "isAboutIHA":true
      },
      {
         "id":"26",
         "text":"Drones have been used to inspect and maintain infrastructure such as bridges and buildings, making it safer for workers.",
         "isAboutIHA":true
      },
      {
         "id":"27",
         "text":"Drones have been used to create 3D models of landscapes and buildings for mapping and surveying purposes.",
         "isAboutIHA":true
      },
      {
         "id":"28",
         "text":"The use of drones in the mining industry has allowed companies to survey and map large areas of land quickly and efficiently.",
         "isAboutIHA":true
      },
      {
         "id":"29",
         "text":"Drones have been used to inspect and monitor pipelines, making it safer and more efficient for workers.",
         "isAboutIHA":true
      },
      {
         "id":"30",
         "text":"Drones have been used to assist in disaster relief efforts, providing search and rescue support, and assessing damage in affected areas.",
         "isAboutIHA":true
      },
      {
         "id":"31",
         "text":"The use of drones in the construction industry has allowed companies to monitor progress and identify potential issues on job sites.",
         "isAboutIHA":true
      },
      {
         "id":"32",
         "text":"Drones have been used to inspect and survey offshore oil and gas platforms, improving worker safety and efficiency.",
         "isAboutIHA":true
      },
      {
         "id":"33",
         "text":"The use of drones in agriculture has increased in recent years, helping farmers monitor crops and identify problem areas.",
         "isAboutIHA":true
      },
      {
         "id":"34",
         "text":"Drones are also being used in search and rescue missions, allowing rescuers to cover large areas quickly and safely.",
         "isAboutIHA":true
      },
      {
         "id":"35",
         "text":"Drones are increasingly being used for wildlife conservation efforts, helping researchers monitor animal populations and protect habitats.",
         "isAboutIHA":true
      },
      {
         "id":"36",
         "text":"Virtual reality technology has been used in education to create immersive learning experiences and engage students.",
         "isAboutIHA":false
      },
      {
         "id":"37",
         "text":"Augmented reality is being used in the retail industry to provide customers with virtual try-on experiences and improve the shopping process.",
         "isAboutIHA":false
      },
      {
         "id":"38",
         "text":"Artificial intelligence is being used in healthcare to analyze patient data and develop more personalized treatment plans.",
         "isAboutIHA":false
      },
      {
         "id":"39",
         "text":"Blockchain technology is being used in finance to improve security and reduce transaction costs.",
         "isAboutIHA":false
      },
      {
         "id":"40",
         "text":"The Internet of Things (IoT) is being used in manufacturing to monitor production processes and improve efficiency.",
         "isAboutIHA":false
      },
      {
         "id":"41",
         "text":"Nanotechnology is being used in materials science to create new materials with unique properties and applications.",
         "isAboutIHA":false
      },
      {
         "id":"42",
         "text":"Renewable energy technologies like solar and wind power are being used to reduce dependence on fossil fuels.",
         "isAboutIHA":false
      },
      {
         "id":"43",
         "text":"3D printing technology is being used in manufacturing to create prototypes and produce custom parts.",
         "isAboutIHA":false
      },
      {
         "id":"44",
         "text":"Cybersecurity measures are being implemented to protect individuals and organizations from cyber attacks and data breaches.",
         "isAboutIHA":false
      },
      {
         "id":"45",
         "text":"Robotics technology is being used in industries like manufacturing, healthcare, and logistics to automate processes and improve efficiency.",
         "isAboutIHA":false
      },
      {
         "id":"46",
         "text":"Smart home technology is being used to create more energy-efficient and convenient living spaces.",
         "isAboutIHA":false
      },
      {
         "id":"47",
         "text":"Space exploration efforts are ongoing, with plans to explore Mars and establish a permanent human presence on the planet.",
         "isAboutIHA":false
      },
      {
         "id":"48",
         "text":"The field of biotechnology is advancing, with new techniques being developed to treat diseases and improve crop yields.",
         "isAboutIHA":false
      },
      {
         "id":"49",
         "text":"Quantum computing is being developed to solve complex problems that cannot be solved by traditional computers.",
         "isAboutIHA":false
      }
   ]
}