{
   "intents":[
      {
         "id":"0",
         "text":"The cat jumped over the fence.",
         "isAboutIHA":false
      },
      {
         "id":"1",
         "text":"I love eating pizza on the weekends.",
         "isAboutIHA":false
      },
      {
         "id":"2",
         "text":"She plays the guitar beautifully.",
         "isAboutIHA":false
      },
      {
         "id":"3",
         "text":"The sun sets in the west.",
         "isAboutIHA":false
      },
      {
         "id":"4",
         "text":"I'm looking forward to my vacation next month.",
         "isAboutIHA":false
      },
      {
         "id":"5",
         "text":"He woke up early to go for a run.",
         "isAboutIHA":false
      },
      {
         "id":"6",
         "text":"The flowers in the garden are in full bloom.",
         "isAboutIHA":false
      },
      {
         "id":"7",
         "text":"She reads a book every night before bed.",
         "isAboutIHA":false
      },
      {
         "id":"8",
         "text":"I prefer tea over coffee in the morning.",
         "isAboutIHA":false
      },
      {
         "id":"9",
         "text":"He always wears a hat when he goes outside.",
         "isAboutIHA":false
      },
      {
         "id":"10",
         "text":"The movie was so suspenseful that I couldn't look away.",
         "isAboutIHA":false
      },
      {
         "id":"11",
         "text":"I can't wait to try the new restaurant that just opened up.",
         "isAboutIHA":false
      },
      {
         "id":"12",
         "text":"She has a beautiful singing voice.",
         "isAboutIHA":false
      },
      {
         "id":"13",
         "text":"I'm trying to drink more water throughout the day.",
         "isAboutIHA":false
      },
      {
         "id":"14",
         "text":"The sky was a beautiful shade of blue this morning.",
         "isAboutIHA":false
      },
      {
         "id":"15",
         "text":"He likes to play video games in his free time.",
         "isAboutIHA":false
      },
      {
         "id":"16",
         "text":"I need to buy some new clothes for the summer.",
         "isAboutIHA":false
      },
      {
         "id":"17",
         "text":"She is learning how to speak Spanish.",
         "isAboutIHA":false
      },
      {
         "id":"18",
         "text":"The concert was amazing, I had so much fun.",
         "isAboutIHA":false
      },
      {
         "id":"19",
         "text":"I love spending time in nature, hiking and camping.",
         "isAboutIHA":false
      },
      {
         "id":"20",
         "text":"The latest iPhone has some amazing features and capabilities.",
         "isAboutIHA":false
      },
      {
         "id":"21",
         "text":"I'm learning to play the guitar and it's been a lot of fun so far.",
         "isAboutIHA":false
      },
      {
         "id":"22",
         "text":"I just finished reading a great book about space exploration.",
         "isAboutIHA":false
      },
      {
         "id":"23",
         "text":"I enjoy trying new recipes and cooking for my friends and family.",
         "isAboutIHA":false
      },
      {
         "id":"24",
         "text":"I'm planning a trip to Japan next year and I'm really excited about it.",
         "isAboutIHA":false
      },
      {
         "id":"25",
         "text":"I've been practicing yoga for a few months now and I'm already noticing the benefits.",
         "isAboutIHA":false
      },
      {
         "id":"26",
         "text":"I recently watched a documentary about the history of jazz music and it was fascinating.",
         "isAboutIHA":false
      },
      {
         "id":"27",
         "text":"I'm studying French so that I can travel to Paris and communicate with the locals.",
         "isAboutIHA":false
      },
      {
         "id":"28",
         "text":"I enjoy painting and have been working on a series of abstract pieces lately.",
         "isAboutIHA":false
      },
      {
         "id":"29",
         "text":"I'm a big fan of science fiction movies and books.",
         "isAboutIHA":false
      },
      {
         "id":"30",
         "text":"I'm taking a course on entrepreneurship and hope to start my own business one day.",
         "isAboutIHA":false
      },
      {
         "id":"31",
         "text":"I've been practicing mindfulness meditation and it's helped me manage stress and anxiety.",
         "isAboutIHA":false
      },
      {
         "id":"32",
         "text":"I enjoy playing basketball with my friends on weekends.",
         "isAboutIHA":false
      },
      {
         "id":"33",
         "text":"I'm learning to knit and it's a great way to relax and unwind.",
         "isAboutIHA":false
      },
      {
         "id":"34",
         "text":"I'm an avid runner and have completed several half marathons.",
         "isAboutIHA":false
      },
      {
         "id":"35",
         "text":"I love going to the theater and watching live performances.",
         "isAboutIHA":false
      },
      {
         "id":"36",
         "text":"I'm trying to learn how to code and it's been challenging but rewarding.",
         "isAboutIHA":false
      },
      {
         "id":"37",
         "text":"I love to travel and explore new places. There's something so exhilarating about experiencing different cultures and customs.",
         "isAboutIHA":false
      },
      {
         "id":"38",
         "text":"The best way to learn a new language is through immersion. When you surround yourself with the language and culture, you pick it up much faster.",
         "isAboutIHA":false
      },
      {
         "id":"39",
         "text":"Yoga has been shown to have numerous health benefits, including improved flexibility, reduced stress, and better sleep.",
         "isAboutIHA":false
      },
      {
         "id":"40",
         "text":"Volunteering at a local animal shelter is a great way to give back to your community and help animals in need.",
         "isAboutIHA":false
      },
      {
         "id":"41",
         "text":"Cooking is a fun and creative way to express yourself. There's nothing like preparing a delicious meal for your loved ones to enjoy.",
         "isAboutIHA":false
      },
      {
         "id":"42",
         "text":"Reading is one of my favorite pastimes. Whether it's a gripping thriller or a heartwarming romance, there's nothing like getting lost in a good book.",
         "isAboutIHA":false
      },
      {
         "id":"43",
         "text":"Painting is a great way to relieve stress and express yourself creatively. You don't have to be a professional artist to enjoy the benefits of this hobby.",
         "isAboutIHA":false
      },
      {
         "id":"44",
         "text":"Spending time with friends and family is so important for our emotional well-being. Whether it's a game night or a dinner party, make sure to make time for the people you love.",
         "isAboutIHA":false
      },
      {
         "id":"45",
         "text":"Learning a musical instrument is a challenging but rewarding experience. Not only does it improve your cognitive skills, but it's also a fun way to express yourself.",
         "isAboutIHA":false
      },
      {
         "id":"46",
         "text":"Hiking is a great way to get exercise and enjoy the beauty of nature. There's nothing like the feeling of accomplishment after completing a challenging hike.",
         "isAboutIHA":false
      },
      {
         "id":"47",
         "text":"Photography is a wonderful way to capture the beauty of the world around us. Whether it's a stunning landscape or a candid moment, a picture truly is worth a thousand words.",
         "isAboutIHA":false
      },
      {
         "id":"48",
         "text":"Playing sports is a great way to stay active and improve your physical fitness. Whether it's a pick-up game of basketball or a round of golf, there's a sport for everyone to enjoy.",
         "isAboutIHA":false
      },
      {
         "id":"49",
         "text":"Going to concerts and live music events is an incredible way to experience the power of music. There's something so special about being in a room full of people, all sharing the same passion for music.",
         "isAboutIHA":false
      }
   ]
}