{
    "hocalar": [
        {
            "ad": "Prof. Dr. Banu Diri",
            "ofis": "EEF-D222",
            "link": "http://avesis.yildiz.edu.tr/diri/",
            "erkek_mi": false,
            "dersler": [
                "Sayısal Analiz",
                "Ayrık Matematik",
                "Doğal Dil İşlemeye Giriş",
                "Seminer ve Meslek Etiği",
                "Veri Sıkıştırma"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Çok tatlı bir hoca, derslerini seviyor, yoklamaya biraz önem veriyor, güzel anlatıyor, anlattığını soruyor. Arada sırada çok sinirleniyor."
                },
                {
                    "kisi": "Astro",
                    "yorum": "Hoca işin mantığını anlatma derdinde, güncel teknolojileri yakalamak imkansız zaten ama tüm derslerinde o konunun nasıl bu aşamaya kadar geldiğini, problemin kaynağı ve çözüm metodolojilerini kavramanı istiyor ve çok güzel anlatıyor. Zaten özellikle üzerinde durduğu kavramanı istediği konuyu da sınavda soruyor. Bölüm boyunca en keyif aldığım hocalardan biriydi."
                },
                {
                    "kisi": "Tehlikeli Pinokyo",
                    "yorum": "Düsunceli, anlayisli ve iyi niyetli. Bölümü sevdiren hocalardan birisidir."
                },
                {
                    "kisi": "Madmax",
                    "yorum": "Çok tatlı ve iyi niyetli bir hocamız. Ama sınavları okurken gidişattan puan alırım beklentisine sakın girmeyin. Sonuç doğruysa tam puan alırsınız, tüm işlem aşamaları doğruysa bile sonuç yanlışsa puan almanız çok zor."
                }
            ],
            "anlatim_puani": 83,
            "kolaylik_puani": 77,
            "ogretme_puani": 84,
            "eglence_puani": 85,
            "oy_sayisi": 19,
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Prof. Dr. Oya Kalıpsız",
            "ofis": "EEF-D131",
            "link": "http://avesis.yildiz.edu.tr/kalipsiz/",
            "erkek_mi": false,
            "dersler": [
                "Sistem Analizi ve Tasarımı",
                "Yazılım Kalite ve Test Süreci",
                "Yönetim Bilgi Sistemleri",
                "Yazılım Mühendisliği",
                "Yazılım Kalitesi ve Test Teknikleri"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Sakin bir hoca, iyi niyetli, yoklama alır."
                },
                {
                    "kisi": "Tehlikeli Pinokyo ",
                    "yorum": "Verdigi dersler bölüm icin onemli ama gereksiz fazla kredi, tek kredilik dersler, kolaylikla gecersiniz."
                }
            ],
            "anlatim_puani": 30,
            "kolaylik_puani": 73,
            "ogretme_puani": 36,
            "eglence_puani": 23,
            "oy_sayisi": 6
        },
        {
            "ad": "Prof. Dr. M. Fatih Amasyalı",
            "ofis": "EEF-D213",
            "link": "http://avesis.yildiz.edu.tr/amasyali/",
            "erkek_mi": true,
            "dersler": [
                "Yapısal Programlamaya Giriş",
                "Yapay Zeka",
                "Uzman Sistemlere Giriş",
                "Bilgisayar Mühendisleri İçin Diferansiyel Denklemler",
                "Kollektif Öğrenme"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Sakin bir hoca, dersi iyi anlatır, anlattığını sorar. Öğretmek için ne kadar kasmak gerekiyorsa o kadar kasar."
                },
                {
                    "kisi": "Astro",
                    "yorum": "Algoritma YZ yi çok kavratıyor. Bir problemi en optimum şekilde nasıl çözeriz. Aşama aşama önce en kötü çözümden sonrasında en iyiye nasıl ulaşırızı güzel kavratıyor. Sınavları da ona göre zorlukta. Ama iş hayatında da bir geliştirme yaparken önce en kötüsünden çözüyor sonrasında tecrübe kazandıkça daha iyi çözümlere yol alıyorsunuz. İşte bunun nasıl geliştiğini anlatan hoca. tavsiye ederim"
                },
                {
                    "kisi": "Tehlikeli Pinokyo ",
                    "yorum": "Dunya umrunda degil, bilgili ve donanimli hocalardan, kimseyle polemige girmez dersi gecmeyi hakediyorsan gecersin."
                },
                {
                    "kisi": "Madmax",
                    "yorum": "Ders anlatımı çok iyi. Somutlamaları ve interaktif anlatım yöntemleri sayesinde dersi kesinlikle çok iyi anlayacaksınız."
                },
                {
                    "kisi": "Violancello",
                    "yorum": "Bilim aşkıyla yanıp tutuşan mükemmel bir hoca. Yapay zeka başta olmak üzere verdiği derslerde işin bilimsel mantığını öğretir, sınavları da kalitelidir boş detaylara takılmaz öğrencilere işlem ameleliği yaptırmaz. Bazı hocalar öğrenciye hayatı zorlaştırmakla uğraştırken Fatih hocam 2024'ün ilk haftasında 3 makale yayınladı bile :)"
                },
                {
                    "kisi": "Ufouser",
                    "yorum": "ders anlatımı iyidir.Sınıavları standarttır çalısan yuksek not alabilir ama çalışmayana derse girmeyene zordur.samimi ve cana yakın bir hocadır.yoklamayı cok takmaz."
                },
                {
                    "kisi": "Buraya Isim Mi Yazılıyor",
                    "yorum": "Diğer yıldız mezunu tayfada olduğu gibi kaliteli bir hocamız. derste kod yazmama gibi bir huyu olsa da teorik olarak ucurur(yapay zeka dersi özellikle kafa acıcı). Bilgisayar ve bitirme projeleri için projeden bağımsız tercih edilebilir cünkü çok anlayışlı birisi. Ders içeriklerini paylaştığı kendi sitesi var. Ödevleri ve sınavları belli bir sisteme oturtmuş işliyor."
                }
            ],
            "anlatim_puani": 92,
            "kolaylik_puani": 74,
            "ogretme_puani": 92,
            "eglence_puani": 87,
            "oy_sayisi": 14,
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Prof. Dr. M. Elif Karslıgil",
            "ofis": "EEF-D217",
            "link": "http://avesis.yildiz.edu.tr/elif/",
            "erkek_mi": false,
            "dersler": [
                "Algoritma Analizi",
                "Görüntü İşleme",
                "Veri Yapıları ve Algoritmalar"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Sert bir mizacı var. Sınavlarda zor sorar."
                },
                {
                    "kisi": "Tehlikeli Pinokyo ",
                    "yorum": "iyi bir insan olabilir ama Elif hocadan ders almamayi tercih ederim."
                },
                {
                    "kisi": "Usmanaga",
                    "yorum": "Bazı sınavları bile kendisi hazırlamıyor sınav esnasında biz ona sorunca görüyor bizimle beraber kafa yoruyor. Başkasına hazırlatıyor neyse ama hiç bakmamış olması çok kötü. Her sınavında düzeltme yapılması gerekiyor. Bu niye diğer hocalarda olmuyor, niye Elif Hoca'nın her sınavında oluyor? Sınav esnasında düzeltme yapınca her şey çözüldü sanıyorlar ama kimse bizim o yanlışlık yüzünden ne kadar süre harcadığımızı sormuyor ne gibi bir strateji ile sınavı çözdüğümüzü bilmiyor. Sınavları en geç okuyan hocalardan. 1.vizeyi finale 1 hafta kala açıklıyor. Bazen finali büt gecesi açıklıyor sabah bi bakıyorsunuz meğer o gün sınavınız varmış dün gece belli olmuş ve saati geçmiş. Sınav kağıdına itiraz ettirmiyor zaten isteseniz de edemezsiniz çünkü o okuyana kadar kağıdınızı unutmuş oluyorsunuz. Ama dersi iyi anlatıyor. Ha bu arada mail konusunda da çok iyi denemez ama çok kötü de değil. %50 ihtimalle ulaşıyorsunuz. Bence artık bir şey öğretmek gibi bir derdi yok. Ben ne seçmeli ne de zorunlu derslerden Elif Hoca'yı seçmenizi önermezdim. Ama zorunlu derslerde diğer seçenekler de pek iyi değil. Hocayla alakalı bir sorunum gerçekten yok zaten mezunum. Burada kalan arkadaşlara tavsiye vermekten ziyade belki hoca bir gün görür bu yazdıklarımı da bu konularda iyileştirme yapma yoluna gider diye yazıyorum. Çünkü kimse okul boyunca fikirlerimizi sormadı. Tek derdim ilgili kişilerin bu söylediklerimi eleştiri olarak kabul edip en azından birkaç tanesinde iyileştirme yapması. Bunu ifade edebileceğimiz bir platform yok okulda. Ben mezun olduğum okulun daha iyi olmasını istiyorum. Adının iyi anılmasını istiyorum. Saygılarımla."
                }
            ],
            "anlatim_puani": 60,
            "kolaylik_puani": 49,
            "ogretme_puani": 58,
            "eglence_puani": 48,
            "oy_sayisi": 13,
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Prof. Dr. Sırma Yavuz",
            "ofis": "EEF-D130",
            "link": "http://avesis.yildiz.edu.tr/smyavuz/",
            "erkek_mi": false,
            "dersler": [
                "İstatistik ve Olasılık Hesapları",
                "Bilgisayar Mühendisleri İçin Diferansiyel Denklemler"
            ],
            "ogrenci_gorusleri": [],
            "anlatim_puani": 40,
            "kolaylik_puani": 50,
            "ogretme_puani": 50,
            "eglence_puani": 30,
            "oy_sayisi": 1
        },
        {
            "ad": "Prof. Dr. Songül Varlı",
            "ofis": "EEF-D221",
            "link": "http://avesis.yildiz.edu.tr/sbayrak/",
            "erkek_mi": false,
            "dersler": [
                "Bilgisayarla Görme",
                "Veri Madenciliği ve Bilgi Keşfi"
            ],
            "ogrenci_gorusleri": [],
            "anlatim_puani": 60,
            "kolaylik_puani": 46,
            "ogretme_puani": 50,
            "eglence_puani": 36,
            "oy_sayisi": 3
        },
        {
            "ad": "Doç. Dr. Gökhan Bilgin",
            "ofis": "EEF-D218",
            "link": "http://avesis.yildiz.edu.tr/gbilgin/",
            "erkek_mi": true,
            "dersler": [
                "Lojik Devreler",
                "Elektronik Devreler",
                "Devre Teorisi ve Elektronik Devreler",
                "Veri Madenciliğine Giriş"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Dersi basit anlatır. Genelde çıkmış sorar. Bol bol ödev verir."
                },
                {
                    "kisi": "Astro",
                    "yorum": "derslerine gecikmeyin, soru sormaktan çekinmeyin, direk derste ne anlatıyorsa o çıkar, fazlasını bilmene gerek kalmaz. Bu adamın derslerinde geçmiş yılların sorularını bulan geçer."
                },
                {
                    "kisi": "Tehlikeli Pinokyo ",
                    "yorum": "Secmeli derslerini gecmeyeni döverler, bi defasinda test seklindeki sinavda dogru cevaplari isaretlemisti, yazici hatasi isteyen isaretlesin demisti :)"
                },
                {
                    "kisi": "Madmax",
                    "yorum": "Dersi olabildiğince kompakt anlatır ve anlatmadığı en ufak bir şeyi de sınavda sormaz. Dersine girip biraz da çalışırsanız gayet yüksek puan alabilirsiniz derslerinden."
                },
                {
                    "kisi": "Violancello",
                    "yorum": "Derste sakız çiğnenmesi gibi önemsiz detaylara takılıyor, 30 hoca için sorun olmayan durum niye onun için sorun oluyor anlamıyorum açıkçası. Bunun dışında dersleri gayet güzel anlatıyor."
                }
            ],
            "anlatim_puani": 67,
            "kolaylik_puani": 71,
            "ogretme_puani": 67,
            "eglence_puani": 56,
            "oy_sayisi": 8
        },
        {
            "ad": "Doç. Dr. M. Amaç Güvensan",
            "ofis": "EEF-DZ35",
            "link": "http://avesis.yildiz.edu.tr/amac/",
            "erkek_mi": true,
            "dersler": [
                "Bilgisayar Bilimlerine Giriş",
                "Algoritma Analizi",
                "Mobil Programlamaya Giriş",
                "Veri Yapıları ve Algoritmalar"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Çok zorlar. Birüsrü (GERÇEKTEN BİRSÜRÜ) ödev verir. Ödevler öğretir."
                },
                {
                    "kisi": "Astro",
                    "yorum": "BBG ve Algoritma için çok iyi anlatan bir hoca. Ama anlattığını da görmek istiyor. Malumunuz algoritma problemleri biraz kafa yormak ve o bakış açısını kazanmakla ilgili bunun için de aynı konuyu 3-4 kere dinlemeniz üzerine kafa yormanız gerekli. Ama hoca bunu tek defada anlatınca kavrandığını düşünerek aynı soruyu ikinci kez sorduğunda cevap verilmesini bekleyen bir tip. Bu konuda da öğrenciye çok üst perdeden yaklaşıyor. Egonuz ezilebilir dikkat !!!"
                },
                {
                    "kisi": "Ufouser",
                    "yorum": "ders anlatışı iyi ve ayrıntılıdır bu yüzden sınavları da iyi olur notu kıt verebilir"
                }
            ],
            "anlatim_puani": 66,
            "kolaylik_puani": 37,
            "ogretme_puani": 67,
            "eglence_puani": 40,
            "oy_sayisi": 17
        },
        {
            "ad": "Doç. Dr. Mehmet Sıddık Aktaş",
            "ofis": "EEF-DZ31",
            "link": "http://avesis.yildiz.edu.tr/aktas/",
            "erkek_mi": true,
            "dersler": [
                "Nesneye Yönelik Programlama",
                "Bilgiye Erişim Ve Arama Motorları",
                "Yazılım Mühendisliği"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Harf notunu güzel verir."
                },
                {
                    "kisi": "Usmanaga",
                    "yorum": "Asla ama asla ders almayın. Çok ilgisiz çok sorumsuz bir hocamız. Hala çıkmış soru paylaşacak mesela. Ders anlatımı hakkında bir şey demeyeceğim ama diğer konularda kesinlikle madur olursunuz. Kendisi bize çıkmış soruları paylaşacağını söyledi. Her hafta bir sonraki hafta paylaşacağını söyledi. Yok. Vizeye yok finale girdik hala yok. Mezun oldum hala yok. Derse gelmeyeceğini o sabah söylüyor zaten dersi sabahtan. Sınavları çok geç okuyor maillere dönmüyor. Ödevlere de çok iyi bakıyor denemez. Uzak durun derslerinden. İngilizcesi iyi onun hakkını vereyim."
                }
            ],
            "anlatim_puani": 62,
            "kolaylik_puani": 57,
            "ogretme_puani": 60,
            "eglence_puani": 50,
            "oy_sayisi": 4
        },
        {
            "ad": "Dr. M. Utku Kalay",
            "ofis": "EEF-D214",
            "link": "http://avesis.yildiz.edu.tr/ukalay/",
            "erkek_mi": true,
            "dersler": [
                "Veritabanı Yönetimi",
                "Veritabanı Sistemlerinin Gerçekleştirilmesi",
                "Veri Tabanı Sistemlerinde Güncel Konular",
                "Veri Tabanı Sistemlerinin Gerçeklenmesi"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Veri tabanını çok iyi bilir. İşini sever. Çok karmaşık anlatır."
                },
                {
                    "kisi": "Teradata",
                    "yorum": "Açıklaması için açıklama gerektiren bir hocadır. Konusu (veri tabanı) hakkında bilmediği yoktur. Rahat bir hocadır, yoklama aldığını görmedim. verdiği seçmeli dersler detay doludur, önermem."
                }
            ],
            "anlatim_puani": 27,
            "kolaylik_puani": 56,
            "ogretme_puani": 37,
            "eglence_puani": 12,
            "oy_sayisi": 9
        },
        {
            "ad": "Dr. Oğuz Altun",
            "ofis": "EEF-DZ36",
            "link": "http://avesis.yildiz.edu.tr/oaltun/",
            "erkek_mi": true,
            "dersler": [
                "İstatistik ve Olasılık Hesapları",
                "Hesaplama Kuramı",
                "Oyun Geliştirmeye Giriş",
                "Bilgisayarla Görme"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Klasik sınavda sorunun cevabı yanlışsa adalet için, gidiş yoluna bakmadan 0 verir."
                }
            ],
            "anlatim_puani": 32,
            "kolaylik_puani": 32,
            "ogretme_puani": 33,
            "eglence_puani": 16,
            "oy_sayisi": 8
        },
        {
            "ad": "Dr. Yunus Emre Selçuk",
            "ofis": "EEF-D129",
            "link": "http://avesis.yildiz.edu.tr/yselcuk/",
            "erkek_mi": true,
            "dersler": [
                "Yapısal Programlama",
                "Nesneye Yönelik Programlama",
                "Yazılım Mühendisliği",
                "Nesneye Dayalı Tasarım ve Modelleme"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "İşini sever. Sakindir."
                },
                {
                    "kisi": "Astro",
                    "yorum": "aslında alanında (yazılım mühendisliği, OOP) çok bilgili bir hoca, ama muhtelemen ailevi problemlerinden dolayı derse ilgisi bir hayli düşük. Bu da öğrenciyi olumsuz etkiliyor. Şeker gibi tatlı ama çok fazla göremeyeceğiniz biri. Kendini geliştirmek isteyenlerin değil dersi geçeyim de nolursa olsun diyenler için..."
                },
                {
                    "kisi": "Ufouser",
                    "yorum": "Dersi standart bir şekilde anlatır yoklama almaz sınavda bol puan verir ama sınavı hazırlamadığı için anlatmadığı şeyler çıkar büyük ihtimalle diger hocanın soyledikle çıkar sınavda"
                },
                {
                    "kisi": "Yıldızlı",
                    "yorum": "Yunus Emre hocanın en öne çıkan özelliği güleç yüzlülüğü ve derslerdeki ilgi alakası. Dersteyken asla gerilme veya sıkılma olmuyor. Sorular sorulara gerçekten değer vererek cevaplamaya ve anladığınızdan emin olayı önemsiyor. İyi hoca."
                }
            ],
            "anlatim_puani": 71,
            "kolaylik_puani": 87,
            "ogretme_puani": 70,
            "eglence_puani": 74,
            "oy_sayisi": 7
        },
        {
            "ad": "Dr. Göksel Biricik",
            "ofis": "EEF-D127",
            "link": "http://avesis.yildiz.edu.tr/gbiricik/",
            "erkek_mi": true,
            "dersler": [
                "Veri Yapıları ve Algoritmalar",
                "Bilgisayar Bilimlerine Giriş",
                "Sistem Analizi ve Tasarımı",
                "Mesleki Hukuk ve Etik"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Dersi eğlenceli anlatır. Güleçtir. Çok kasmaz. Sınavlarda düşük puan verir ama harf notlarını yüksek verir."
                },
                {
                    "kisi": "Nakliyeci Sefer",
                    "yorum": "Dersi eğlenceli anlatmaya çalışır, yoklamaya çok takmaz, geç girenlere laf söylemez. Öğrencileri bırakmamaya çalışır ."
                },
                {
                    "kisi": "Astro",
                    "yorum": "dersleri eğlenceli, öğrenciyle muhabbeti seven bir hoca. Konusu da basitçe anlatıp geçiyor. Aynı dersi veren diğer hocalara göre bir tık az öğrenebilirsiniz ama yeterli bilgiyi alırsınız. Çok sevimli bir hoca"
                },
                {
                    "kisi": "Madmax",
                    "yorum": "Dersi çok iyi anlatır. Sorduğunuz soruyu da elinden geldiğince, sorunun saçma olup olmadığına bakmadan cevaplar. Şiddetle tavsiye edilir."
                }
            ],
            "anlatim_puani": 80,
            "kolaylik_puani": 65,
            "ogretme_puani": 80,
            "eglence_puani": 85,
            "oy_sayisi": 2
        },
        {
            "ad": "Dr. Erkan Uslu",
            "ofis": "EEF - D034",
            "link": "http://avesis.yildiz.edu.tr/euslu/",
            "erkek_mi": true,
            "dersler": [
                "Bilgisayar Donanımı",
                "Alt Seviye Programlama",
                "Mikroişlemci Sistemleri ve Assamly Dili",
                "Mikroişlemci Sistemleri ve Assambly Dili",
                "Mikroişlemci Sistemleri ve Assembly Dili",
                "Mikroişlemci Sistemleri",
                "Bilgisayar Organizasyonu",
                "Sayısal İşaret İşleme"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Konusunda çok bilgilidir. Derste konudan konuya atlarsa aklınız karışabilir."
                },
                {
                    "kisi": "Nakliyeci Sefer",
                    "yorum": "Çok bilgilidir, derse karşı sorumludur. İyi anlatmaya çalışır, ödevleri, dersleri ve sınavları genelde zorlayıcıdır. Bölümün en kaliteli hocalarından biridir."
                },
                {
                    "kisi": "Astro",
                    "yorum": "okulun en zeki hocalarından biri, bence MFA ile kapışır :D donanım anlamında çok bilgili, bazen dili düşüncesine yetişemez havaya bakarak konuşur. Ama çok hızlı konuşuyor ve cümle kurarken o kadar hassas olduğunu görüyorsunuz ki hatalı cümle kurmamaya çok çalışıyor. Konusunda her türlü soruya cevap verir kafanda soru işareti bırakmaz. Sınavlarında hep zeka ölçer sorular sorar. Yani konuyu anlayıp kavraman yetmez bir de çözmen gereken bir zeka sorusu vardır. Pratik düşünemezsen o soruyu çözemezsin. Ama öğrenmekten ve öğretmekten zevk alan bir hoca."
                }
            ],
            "anlatim_puani": 51,
            "kolaylik_puani": 42,
            "ogretme_puani": 55,
            "eglence_puani": 36,
            "oy_sayisi": 10
        },
        {
            "ad": "Doç. Dr. Hamza Osman İlhan",
            "ofis": "EEF-D124",
            "link": "http://avesis.yildiz.edu.tr/hoilhan/",
            "erkek_mi": true,
            "dersler": [
                "Lojik Devreler",
                "Elektronik Devreler",
                "Seminer ve Meslek Etiği",
                "Devre Teorisi ve Elektronik Devreler",
                "İleri Ağ Programlama"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Dersi iyi anlatır. Notu ortalama verir. Genelde çıkmış sorar."
                },
                {
                    "kisi": "Nanadaime",
                    "yorum": "Güzel hocadır severim kendisini ama bazen ders esnasında dikkati kaybolana kızabiliyor. Telefonda ders ile alakalı bir şeyler baksan bile gözü seni kesebilir. Her an kızabilir dikkat et."
                },
                {
                    "kisi": "Ufouser",
                    "yorum": "Donanım derslerine girer ders anlatışı diksiyonu gayet iyidir"
                }
            ],
            "anlatim_puani": 60,
            "kolaylik_puani": 75,
            "ogretme_puani": 58,
            "eglence_puani": 51,
            "oy_sayisi": 8,
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Dr. H. İrem Türkmen",
            "ofis": "EEF-DZ32",
            "link": "http://avesis.yildiz.edu.tr/irem/",
            "erkek_mi": false,
            "dersler": [
                "Yapısal Programlama"
            ],
            "ogrenci_gorusleri": [],
            "anlatim_puani": 100,
            "kolaylik_puani": 65,
            "ogretme_puani": 85,
            "eglence_puani": 75,
            "oy_sayisi": 2
        },
        {
            "ad": "Doç. Dr. Ali Can Karaca",
            "ofis": "",
            "link": "https://avesis.yildiz.edu.tr/17218",
            "erkek_mi": true,
            "dersler": [
                "Bilgisayar Mühendisleri için Sinyaller ve Sistemler",
                "Bilgisayar Donanımı",
                "Gömülü Sistemler",
                "Sayısal İşaret İşleme",
                "İstatistiksel Veri Analizi",
                "Bilgisayar Organizasyonu"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "İyi anlatır. Anlattığını sorar. Ödevlerde puanlaması gariptir."
                },
                {
                    "kisi": "Madmax",
                    "yorum": "Ders anlatım ve diğer süreçlerde olabildiğince öğrencilerin faydasını gözetir. Ders anlatımı biraz monoton olsa da sorduğunuz tüm soruları elinden geldiğince cevaplar."
                }
            ],
            "anlatim_puani": 72,
            "kolaylik_puani": 72,
            "ogretme_puani": 74,
            "eglence_puani": 70,
            "oy_sayisi": 9
        },
        {
            "ad": "Dr. Ahmet Elbir",
            "ofis": "",
            "link": "http://avesis.yildiz.edu.tr/aelbir/",
            "erkek_mi": true,
            "dersler": [
                "Bilgisayar Mühendisleri için Sinyaller ve Sistemler",
                "Sayısal İşaret İşleme",
                "Sayısal Analiz",
                "Ayrık Matematik",
                "Yapısal Programlama",
                "Yapısal Programlamaya Giriş",
                "İşletim Sistemleri"
            ],
            "ogrenci_gorusleri": [
                {
                    "kisi": "Violancello",
                    "yorum": "Açık ara bölümde en sevilen hoca. Dersi çok iyi anlatır, sınavları hızlı okur, öğrencilere her konuda yardımcı olur. Mümkün olduğunca çok dersi kendisinden alın. Tamamen Ahmet Elbir hocamızın çabası sayesinde bölümün müfredatı güncellendi çok daha iyi oldu. Bazen sinirlenir ama sinirlendiği her konuda haklı olduğunu düşünüyorum."
                },
                {
                    "kisi": "Tehlikeli Pinokyo ",
                    "yorum": "Bölümdeki en ilkeli hoca diyebilirim. En cok elini tasin altina koyan insan. Cabalayani bir sekilde geciriyor."
                },
                {
                    "kisi": "Yıldızlı",
                    "yorum": "Anlayış ve yardımseverlik konusunda diğer hocalara nispeten çok daha önde gelir. Öğrencilerle ders dışında da iletişim hususunda ilgilidir. Özellikle Ara ve Bitirme projelerini bu hocadan alırsanız iletişim ve sürecin ilerletilmesi konusunda kafanız daha rahat olacaktır."
                },
                {
                    "kisi": "Ufouser",
                    "yorum": "ahmet elbir hocamız yoklamayı takan bir hocamızdır sınavları son derece ayrıntı içerir her soylediğine kulak verin her soylediğini sorar sınavlarında elbet bir 30 puanlık zor bir soru olur soruyu yavas yavas cozun yanlıs yerden itibaren çözümu siler bi anda cok az bi puan alırsınız ders anlatımı normaldir"
                }
            ],
            "anlatim_puani": 70,
            "kolaylik_puani": 62,
            "ogretme_puani": 72,
            "eglence_puani": 55,
            "oy_sayisi": 17
        },
        {
            "ad": "Dr. Furkan Çakmak",
            "ofis": "EEF-D122",
            "link": "http://avesis.yildiz.edu.tr/fcakmak/",
            "dersler": [
                "Nesneye Yönelik Programlama",
                "Robot Teknolojisine Giriş",
                "Alt Seviye Programlama",
                "Veri İletişimi",
                "Mikroişlemci Sistemleri ve Assamly Dili",
                "Veri İletişimi ve Bilgi Ağları",
                "Mikroişlemci Sistemleri ve Assambly Dili",
                "Mikroişlemci Sistemleri ve Assembly Dili",
                "Mikroişlemci Sistemleri",
                "Veri İletişimi ve Bilgisayar Ağları"
            ],
            "erkek_mi": true,
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "İyi anlatır. Hitabeti güzeldir. Bazı derslerde fazla zorlar."
                },
                {
                    "kisi": "Ufouser",
                    "yorum": "Dersin teorik kısımlarını uygulamarda gösterdiği için çokça uygulama yapar bu yüzden daha iyi öğrettiğini düşünüyorum"
                },
                {
                    "kisi": "Violancello",
                    "yorum": "Dersleri güzel anlatan, anlattığı konuların gerçek hayat ve sektördeki uygulamaları hakkında bilgi veren, muhabbeti güzel bir hoca. Fakat harf notlarını çok yüksek tutuyor ve itiraz edince bazen sert tepkiler veriyor."
                }
            ],
            "anlatim_puani": 81,
            "kolaylik_puani": 27,
            "ogretme_puani": 72,
            "eglence_puani": 65,
            "oy_sayisi": 8
        },
        {
            "ad": "",
            "ofis": "",
            "link": "",
            "dersler": [],
            "ogrenci_gorusleri": [],
            "anlatim_puani": 30,
            "kolaylik_puani": 100,
            "ogretme_puani": 30,
            "eglence_puani": 30
        },
        {
            "ad": "",
            "ofis": "",
            "link": "",
            "dersler": [],
            "ogrenci_gorusleri": [],
            "anlatim_puani": 30,
            "kolaylik_puani": 100,
            "ogretme_puani": 30,
            "eglence_puani": 30
        },
        {
            "ad": "Dr. Ziya Cihan Tayşi",
            "ofis": "",
            "link": "https://avesis.yildiz.edu.tr/cihan",
            "erkek_mi": true,
            "dersler": [
                "Bilgisayar Bilimlerine Giriş",
                "İşletim Sistemleri",
                "Veri İletişimi"
            ],
            "hoca_aktif_gorevde_mi": false,
            "anlatim_puani": 10,
            "kolaylik_puani": 20,
            "ogretme_puani": 20,
            "eglence_puani": 10,
            "oy_sayisi": 4
        },
        {
            "ad": "Prof. Dr. Hasan Hüseyin Balık",
            "ofis": "",
            "link": "https://avesis.yildiz.edu.tr/balik",
            "erkek_mi": true,
            "dersler": [
                "Ağ Teknolojileri",
                "Bilişim Sistemleri Güvenliği"
            ],
            "hoca_aktif_gorevde_mi": false,
            "anlatim_puani": 40,
            "kolaylik_puani": 50,
            "ogretme_puani": 40,
            "eglence_puani": 60,
            "oy_sayisi": 1
        },
        {
            "ad": "Prof. Dr. Nizamettin Aydın",
            "ofis": "",
            "link": "https://avesis.itu.edu.tr/naydin",
            "erkek_mi": true,
            "dersler": [
                "Biyoenformatiğe Giriş"
            ],
            "hoca_aktif_gorevde_mi": true,
            "anlatim_puani": 30,
            "kolaylik_puani": 80,
            "ogretme_puani": 30,
            "eglence_puani": 30,
            "oy_sayisi": 1
        },
        {
            "ad": "Arş. Grv. Nurgül Yüzbaşıoğlu",
            "ofis": "EEF-DZ24",
            "link": "http://avesis.yildiz.edu.tr/nurguly/",
            "erkek_mi": false,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Sercan Aygün",
            "ofis": "EEF-DZ26",
            "link": "http://avesis.yildiz.edu.tr/ayguns/",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Alper Eğitmen",
            "ofis": "EEF-D209",
            "link": "http://avesis.yildiz.edu.tr/aegitmen/",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Sultan Sevgi TURGUT",
            "ofis": "D-211",
            "link": "https://avesis.yildiz.edu.tr/sturgut/",
            "erkek_mi": false,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Mustafa Mert KARA",
            "ofis": "D-030",
            "link": "https://avesis.yildiz.edu.tr/mmkara/",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Muzaffer Kaan YÜCE",
            "ofis": "D-025",
            "link": "",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Muhammed Enes ÖZELBAŞ",
            "ofis": "D-030",
            "link": "",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Kübra ADALI",
            "ofis": "D-211",
            "link": "https://avesis.yildiz.edu.tr/adalik/",
            "erkek_mi": false,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Burak Ahmet ÖZDEN",
            "ofis": "D-024",
            "link": "https://avesis.yildiz.edu.tr/bozden",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Emre PARLAK",
            "ofis": "D024",
            "link": "https://avesis.yildiz.edu.tr/emre.parlak",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Mustafa CEBECİ",
            "ofis": "",
            "link": "https://avesis.yildiz.edu.tr/17285",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Rukiye BAŞKARA",
            "ofis": "D-022",
            "link": "",
            "erkek_mi": false,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Elif AŞICI",
            "ofis": "D-033",
            "link": "",
            "erkek_mi": false,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true,
            "ogrenci_gorusleri": [
                {
                    "kisi": "Traktör Reis",
                    "yorum": "Verdirilen dersler konusunda çok bilgi sahibi değildir. Bir keresinde mikro dersinde sınav ya da ödevin çözümünü anlatmaya çalışıyordu. Erkan Hoca'nın kodu üzerinden anlatırken kodun bir satırını yanlış yorumladı. Zaten kendinin de fazla bilgi sahibi olmadığı belliydi. Yusuf Taha Körkem, hocam o kodun sebebi sizin anlattığınız gibi değil demişti. Sonra hoca Yusuf Taha'nın söylediğini anlayamayınca kalkıp kodun kalanını Yusuf Taha anlatmıştı."
                }
            ]
        },
        {
            "ad": "Arş. Grv. Ömer Mutlu Türk KAYA",
            "ofis": "D-033",
            "link": "",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Elçin GÜVEYİ",
            "ofis": "D-022",
            "link": "https://avesis.yildiz.edu.tr/eguveyi/",
            "erkek_mi": false,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true,
            "anlatim_puani": 80,
            "kolaylik_puani": 50,
            "ogretme_puani": 90,
            "eglence_puani": 70,
            "oy_sayisi": 1
        },
        {
            "ad": "Arş. Grv. İdris DEMİR",
            "ofis": "D-025",
            "link": "http://avesis.yildiz.edu.tr/idrisd/",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true,
            "anlatim_puani": 40,
            "kolaylik_puani": 70,
            "ogretme_puani": 30,
            "eglence_puani": 20,
            "oy_sayisi": 1
        },
        {
            "ad": "Arş. Grv. Himmet Toprak KESGİN",
            "ofis": "D-211",
            "link": "",
            "erkek_mi": true,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        },
        {
            "ad": "Arş. Grv. Hatice ERDİRİK",
            "ofis": "D-032",
            "link": "https://avesis.yildiz.edu.tr/17253",
            "erkek_mi": false,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true,
            "anlatim_puani": 60,
            "kolaylik_puani": 70,
            "ogretme_puani": 60,
            "eglence_puani": 60,
            "oy_sayisi": 1
        },
        {
            "ad": "Arş. Grv. Meliha Gizem ÇELİK",
            "ofis": "D-022",
            "link": "https://avesis.yildiz.edu.tr/gizem.celik",
            "erkek_mi": false,
            "dersler": [],
            "hoca_aktif_gorevde_mi": true
        }
    ],
    "bolum_adi": "Hocalar",
    "bolum_aciklamasi": "Bu bölüm, Yıldız Teknik Üniversitesi Bilgisayar Mühendisliği bölümündeki hocaların detaylı bilgilerini içerir. Hocaların adları, ofis bilgileri, araştırma sayfalarının bağlantıları ve verdikleri bazı dersler bu bölümde listelenmektedir. Öğrenciler ve diğer ilgililer için hocalar hakkında temel bilgiler ve iletişim detayları sunulmaktadır. Hocaların puanlamaları tamamen subjektiftir ve  0-10 yıldız arasında yapılmıştır.",
    "en_populer_hoca": {
        "hoca_adi": "Prof. Dr. Banu Diri",
        "oy_sayisi": 19
    }
}