{
   "intents":[
      {
         "id":"0",
         "text":"I just finished reading a new book and I loved it.",
         "isAboutFootball":false
      },
      {
         "id":"1",
         "text":"I'm really excited to go to the beach this weekend.",
         "isAboutFootball":false
      },
      {
         "id":"2",
         "text":"I'm not a big fan of horror movies.",
         "isAboutFootball":false
      },
      {
         "id":"3",
         "text":"I've been practicing yoga for a year now and it has really improved my flexibility.",
         "isAboutFootball":false
      },
      {
         "id":"4",
         "text":"I tried a new restaurant last night and it was terrible.",
         "isAboutFootball":false
      },
      {
         "id":"5",
         "text":"I'm planning a trip to Japan next year.",
         "isAboutFootball":false
      },
      {
         "id":"6",
         "text":"I recently adopted a new puppy and she's been keeping me busy.",
         "isAboutFootball":false
      },
      {
         "id":"7",
         "text":"I'm trying to learn how to play the guitar.",
         "isAboutFootball":false
      },
      {
         "id":"8",
         "text":"I'm really enjoying my new job.",
         "isAboutFootball":false
      },
      {
         "id":"9",
         "text":"I've been binge-watching a new TV series and it's been great so far.",
         "isAboutFootball":false
      },
      {
         "id":"10",
         "text":"I'm planning to redecorate my apartment soon.",
         "isAboutFootball":false
      },
      {
         "id":"11",
         "text":"I'm learning how to cook a new type of cuisine.",
         "isAboutFootball":false
      },
      {
         "id":"12",
         "text":"I'm taking a painting class and I'm really enjoying it.",
         "isAboutFootball":false
      },
      {
         "id":"13",
         "text":"I'm trying to read more books this year.",
         "isAboutFootball":false
      },
      {
         "id":"14",
         "text":"I'm excited to try a new recipe I found online.",
         "isAboutFootball":false
      },
      {
         "id":"15",
         "text":"I'm planning to go on a road trip with friends this summer.",
         "isAboutFootball":false
      },
      {
         "id":"16",
         "text":"I'm learning how to speak a new language.",
         "isAboutFootball":false
      },
      {
         "id":"17",
         "text":"I'm starting a new exercise routine to get in shape.",
         "isAboutFootball":false
      },
{
      "id": "18",
      "text": "I love spending time at the beach and just relaxing.",
      "isAboutFootball": false
    },
    {
      "id": "19",
      "text": "I recently started learning how to play the piano and it's been challenging but rewarding.",
      "isAboutFootball": false
    },
    {
      "id": "20",
      "text": "I've been trying to improve my cooking skills and have been experimenting with new recipes.",
      "isAboutFootball": false
    },
    {
      "id": "21",
      "text": "I enjoy going for long walks in nature and taking in the fresh air.",
      "isAboutFootball": false
    },
    {
      "id": "22",
      "text": "I'm really interested in astronomy and enjoy stargazing whenever I get the chance.",
      "isAboutFootball": false
    },
    {
      "id": "23",
      "text": "I've been practicing yoga for a few months now and it's been great for both my physical and mental health.",
      "isAboutFootball": false
    },
    {
      "id": "24",
      "text": "I recently went on a trip to Japan and fell in love with the food and culture.",
      "isAboutFootball": false
    },
    {
      "id": "25",
      "text": "I'm a big fan of reading and love getting lost in a good book.",
      "isAboutFootball": false
    },
    {
      "id": "26",
      "text": "I've been taking painting classes and it's been a fun and creative outlet for me.",
      "isAboutFootball": false
    },
    {
      "id": "27",
      "text": "I enjoy volunteering at my local animal shelter and spending time with the animals.",
      "isAboutFootball": false
    },
    {
      "id": "28",
      "text": "I love trying new types of food and exploring different cuisines.",
      "isAboutFootball": false
    },
    {
      "id": "29",
      "text": "I've been learning a new language and it's been challenging but fulfilling.",
      "isAboutFootball": false
    },
    {
      "id": "30",
      "text": "I enjoy going to concerts and experiencing live music.",
      "isAboutFootball": false
    },
    {
      "id": "31",
      "text": "I'm a big fan of hiking and enjoy exploring new trails whenever I can.",
      "isAboutFootball": false
    },
    {
      "id": "32",
      "text": "I enjoy spending time with my friends and family and just having good conversations.",
      "isAboutFootball": false
    },
    {
      "id": "33",
      "text": "I'm really interested in history and love visiting museums and historical sites.",
      "isAboutFootball": false
    },
    {
      "id": "34",
      "text": "I love going to the movies and watching all kinds of films.",
      "isAboutFootball": false
    },
    {
      "id": "35",
      "text": "I've been practicing meditation and mindfulness and it's been great for reducing stress and anxiety.",
      "isAboutFootball": false
    },
{
         "id":"36",
         "text":"I'm not really interested in sports.",
         "isAboutFootball":false
      },
      {
         "id":"37",
         "text":"I prefer watching movies or reading books to watching sports.",
         "isAboutFootball":false
      },
      {
         "id":"38",
         "text":"I don't really understand the rules of football, so I don't enjoy watching it.",
         "isAboutFootball":false
      },
      {
         "id":"39",
         "text":"I'm more of a fan of individual sports like tennis or gymnastics.",
         "isAboutFootball":false
      },
      {
         "id":"40",
         "text":"I find football matches to be too long and boring.",
         "isAboutFootball":false
      },
      {
         "id":"41",
         "text":"I'd rather spend my time doing something else than watching football.",
         "isAboutFootball":false
      },
      {
         "id":"42",
         "text":"I think football is overhyped and overrated.",
         "isAboutFootball":false
      },
      {
         "id":"43",
         "text":"I've never really been a fan of football or any other sport for that matter.",
         "isAboutFootball":false
      },
      {
         "id":"44",
         "text":"I find the football culture to be too aggressive and macho for my taste.",
         "isAboutFootball":false
      },
      {
         "id":"45",
         "text":"I don't like the way football fans behave during matches.",
         "isAboutFootball":false
      },
      {
         "id":"46",
         "text":"I think football is a waste of time and energy.",
         "isAboutFootball":false
      },
      {
         "id":"47",
         "text":"I don't like how much attention is given to football in the media.",
         "isAboutFootball":false
      },
      {
         "id":"48",
         "text":"I don't think football is a very intelligent or sophisticated sport.",
         "isAboutFootball":false
      },
      {
         "id":"49",
         "text":"I'd rather spend my money on something other than football tickets.",
         "isAboutFootball":false
      }
   ]
}
