{
    "baslik": "Repo Kullanımı",
    "aciklama": "Açıklamalar:",
    "aciklamalar": [
        "1-1 -> 1. sınıf Güz dönemi",
        "1-2 -> 1. sınıf Bahar dönemi",
        "2-1 -> 2. sınıf Güz dönemi",
        "2-2 -> 2. sınıf Bahar dönemi",
        "3-1 -> 3. sınıf Güz dönemi",
        "3-2 -> 3. sınıf Bahar dönemi",
        "4-1 -> 4. sınıf Güz dönemi",
        "4-2 -> 4. sınıf Bahar dönemi",
        "Mesleki Seçmeli -> Mesleki Seçmeli dersler",
        "Ara Projeler -> yapılıp yüklenen ara projeler",
        "Bitirme Projesi -> yapılıp yüklenen bitirme projeleri",
        "readme_olustur -> readme dosyası oluşturmak için kullanılan python kodu",
        "burada olmayan bazı çıkmış sorulara/lablara/ödevlere [linkten](https://drive.google.com/drive/folders/1LI_Bo7kWqI2krHTw0noUFl9crfZSlrZh) ulaşabilirsiniz."
    ],
    "talimat": "Talimatlar:",
    "talimatlar": [
        "İlgili dönemin/türün klasörünü aç.",
        "İlgili dersin klasörünü aç.",
        "Burada ders ile ilgili yüklenmiş olan notlar, ödevler, lablar, projeler, slaytlar vb. bulunur.",
        "Ödevler lablar vs. cevapları %100 doğru değildir.",
        "Eksik gördüğün yerler ya da katkıda bulunmak için eklemek istediğin dosyalar olursa bizimle iletişime geçebilirsin ya da merge request atabilirsin.",
        "Büyük dosyalar github üstünden açılamadığı için, repoyu yerel bilgisayarınıza indirip açmanız tavsiye edilir..."
    ],
    "kavram": "Kavramlar:",
    "kavramlar": [
        {
            "kavram": "Lab",
            "aciklamalar": [
                "Lab aslında uygulamalı derslerdeki uygulama sınavı anlamına gelmektedir.",
                "Genelde kodlama, devre oluşturma gibi pratik sınavlar olsa da, bazı derslerin labları kağıtta olabilmektedir. (Veri Tabanı)"
            ]
        },
        {
            "kavram": "Ara Proje",
            "aciklamalar": [
                "Ara Proje aslında genelde kodlama içeren öğrencinin teklif ettiği ya da hocanın önerdiği ödevdir. Ve bir danışman eşliğinde yapılır.",
                "Ara projede ve Bitirme projesinde hoca bulmak sonradan zor olduğu için genelde dönem başlamadan önce arayışta olmak gerekir.",
                "Ara proje ve Bitirme projesi 1 ya da 2 kişilik (genelde 2) yapılır.",
                "Ara Proje ve Bitirme Projesi 3 parçadadan oluşur. Bu parçalar her ikisi için de ara rapor (ilk sunulan rapor manasında sadece ara projede değil her ikisinde de mevcut), bitirme raporu (ara raporla benzer şekilde) ve sunumdur.",
                "Sunumda jüri olur. Genelde 2 hoca (biri danışman hoca) 1 tane de asistan olur. Hocalar genelde projeyi pek detaylı incelemez. Gelen asistan çok ayrıntılı sorular sorabilir."
            ]
        },
        {
            "kavram": "Bitirme Projesi",
            "aciklamalar": [
                "Ara projeyle benzerdir. Ama projenin konusu bir tık daha ileri seviye olmalıdır."
            ]
        },
        {
            "kavram": "Staj",
            "aciklamalar": [
                "Bölümle alakalı herhangi bir şirkette, üniversiteye bildirerek çalışma işlemidir.",
                "Dönem içi yapılabilir ama haftada en az 2 günün boş olması lazımdır.",
                "Ara tatilde yapılabilir ama büte kalmamış olmak ve cumartesi dahil staj yapmak gerekir.",
                "Bunlarla uğraşmak istemezseniz, 30 gün sigorta girişiniz varsa staja sayıdırılabiliyor."
            ]
        },
        {
            "kavram": "Vize",
            "aciklamalar": [
                "İlk vizeler (hoca aksini belirtmedikçe) genelde 8. hafta olur",
                "Dersin vize haftasında vizesi olmadığı zaman (hoca aksini belirmedikçe) büyük ihtimalle ders vardır.",
                "İkinci Vize her derste olmaz. 2. Vizesi olmayan dersin 2. Vize haftasında konusu (hoca aksini belirmedikçe) işlenir.",
                "Hocalar genelde önceki senelerdeki sorulara benzer/aynı sorular sorarlar."
            ]
        }
    ]
}