{
	"intents": [
	{
			"tag": "greeting",
			"patterns": [
				"Hi there",
				"How are you",
				"Is anyone there?",
				"Hello",
				"Good morning",
				"Good afternoon"
			],
			"responses": [
				"Hello! How can I help you today?",
				"Hi there! What can I do for you?",
				"Hello, what can I assist you with today?"
			]
		},

		{
			"tag": "yildiz_technique_university",
			"patterns": [
				"Tell me about the Yıldız technique",
				"What is the Yıldız technique?",
				"How do you do the Yıldız technique?"
			],
			"responses": [
				"Yıldız Technical University is a public research university located in Istanbul, Turkey. It was founded in 1911 and is one of the oldest and most prestigious technical universities in Turkey. YTÜ offers a wide range of academic programs in fields such as engineering, natural sciences, social sciences, and arts and humanities. It has a strong focus on research and innovation, and has partnerships with numerous international universities and research institutions. YTÜ is known for its strong programs in engineering and technology, and has a reputation for producing graduates who are highly sought after by employers. In addition to its main campus in Istanbul, Yıldız Technical University has satellite campuses in several other cities in Turkey."
			]
		},
		{
			"tag": "yildiz_technique_university",
			"patterns": [
				"Tell me about Yıldız Technical University",
				"What is Yıldız Technical University?",
				"How do I learn more about Yıldız Technical University?",
				"Can you tell me more about Yıldız Technical University?",
				"What programs does Yıldız Technical University offer?"
			],
			"responses": [
				"Yıldız Technical University is a public research university located in Istanbul, Turkey. It was founded in 1911 and is one of the oldest and most prestigious technical universities in Turkey. Yıldız Technical University offers a wide range of academic programs in fields such as engineering, natural sciences, social sciences, and arts and humanities. It has a strong focus on research and innovation, and has partnerships with numerous international universities and research institutions. Yıldız Technical University is known for its strong programs in engineering and technology, and has a reputation for producing graduates who are highly sought after by employers. In addition to its main campus in Istanbul, Yıldız Technical University has satellite campuses in several other cities in Turkey.",
				"Some popular programs at Yıldız Technical University include engineering, computer science, and business administration. The university also has a strong focus on research, with numerous research centers and institutes dedicated to a wide range of topics. In addition to its academic programs, Yıldız Technical University also offers a range of extracurricular activities and clubs for students to get involved in. If you're interested in studying at Yıldız Technical University, you can learn more about the admissions process and available programs on the university's website."
			]
		},
		{
			"tag": "internships",
			"patterns": [
				"Does Yildiz Technical University have any internship programs?",
				"How can I find internships related to my field of study?",
				"What are the benefits of doing an internship at Yildiz Technical University?",
				"Can I get credit for an internship at Yildiz Technical University?"
			],
			"responses": [
				"Yes, Yildiz Technical University has several internship programs that provide students with the opportunity to gain hands-on experience in their field of study. There are a variety of ways to find internships at Yildiz Technical University, including through the career services office, through your academic department, or by networking with alumni and industry professionals. Internships can provide a number of benefits, including the opportunity to develop practical skills, build a professional network, and explore career options. Some internships may be eligible for academic credit, depending on the program and the requirements of the internship. You can find more information about internships at Yildiz Technical University on the university's website."
			]
		},
		{
			"tag": "operating_systems",
			"patterns": [
				"What is an operating system?",
				"What are some examples of operating systems?",
				"What is the difference between a 32-bit and 64-bit operating system?"
			],
			"responses": [
				"An operating system (OS) is a collection of software that manages computer hardware resources and provides common services for computer programs. Examples of operating systems include Windows, macOS, and Linux. A 32-bit operating system can handle data in 32-bit chunks, while a 64-bit operating system can handle data in 64-bit chunks. A 64-bit operating system can handle more data at once and may be faster, but is not compatible with all software."
			]
		},
		{
			"tag": "database_systems",
			"patterns": [
				"What is a database?",
				"What is a database management system?",
				"What are some examples of database management systems?"
			],
			"responses": [
				"A database is a collection of organized data, usually stored in a structured format such as a table. A database management system (DBMS) is software that allows users to create, access, and manipulate databases. Examples of database management systems include MySQL, Oracle, and Microsoft SQL Server."
			]
		},
		{
			"tag": "computer_architecture",
			"patterns": [
				"What is computer architecture?",
				"What are the different types of computer architecture?",
				"What is a microprocessor?"
			],
			"responses": [
				"Computer architecture is the design and organization of a computer system. There are several types of computer architecture, including von Neumann architecture, Harvard architecture, and RISC (Reduced Instruction Set Computing) architecture. A microprocessor is a central processing unit (CPU) that is built on a microchip and is responsible for executing instructions and manipulating data in a computer."
			]
		},
		{
			"tag": "algorithms",
			"patterns": [
				"What is an algorithm?",
				"What are the different types of algorithms?",
				"What is a sorting algorithm?"
			],
			"responses": [
				"An algorithm is a step-by-step process for solving a problem or completing a task. There are several types of algorithms, including search algorithms, sorting algorithms, and optimization algorithms. A sorting algorithm is an algorithm that arranges a list of items in a specific order, such as ascending or descending order."
			]
		},
		{
			"tag": "data_structures",
			"patterns": [
				"What is a data structure?",
				"What are the different types of data structures?",
				"What is a linked list?"
			],
			"responses": [
				"A data structure is a way of organizing and storing data in a computer so that it can be accessed and modified efficiently. There are several types of data structures, including arrays, linked lists, stacks, queues, and trees. A linked list is a linear data structure in which each element is a separate object that contains a reference to the next element in the list."
			]
		},
		{
			"tag": "software_development",
			"patterns": [
				"What is software development?",
				"What are the different phases of software development?",
				"What is Agile software development?"
			],
			"responses": [
				"Software development is the process of creating and maintaining software applications. The different phases of software development include planning, analysis, design, implementation, testing, and maintenance. Agile software development is a method of software development that emphasizes flexibility and rapid iteration, and involves frequent collaboration between developers, customers, and stakeholders."
			]
		},
		{
			"tag": "software_testing",
			"patterns": [
				"What is software testing?",
				"What are the different types of software testing?",
				"What is a test case?"
			],
			"responses": [
				"Software testing is the process of evaluating a software application to determine if it is working correctly and meets the specified requirements. There are several types of software testing, including unit testing, integration testing, system testing, and acceptance testing. A test case is a set of conditions or variables under which a tester will determine whether a system under test satisfies requirements or works correctly."
			]
		},
		{
			"tag": "computer_science_careers",
			"patterns": [
				"What are some careers in computer science?",
				"What skills are needed for a career in computer science?",
				"What is a computer scientist?"
			],
			"responses": [
				"There are many careers in computer science, including software developer, data scientist, cybersecurity analyst, and systems administrator. Skills needed for a career in computer science include programming, problem-solving, critical thinking, and communication. A computer scientist is a professional who works in the field of computer science, researching and developing new technologies and solutions related to computers and computer systems."
			]
		},
		{
			"tag": "computer_science_concepts",
			"patterns": [
				"What is a computer science concept?",
				"What are some common computer science concepts?",
				"What is a data type?"
			],
			"responses": [
				"Computer science concepts are fundamental ideas and principles that are important in the field of computer science. Some common computer science concepts include algorithms, data structures, programming languages, and computer hardware. A data type is a classification of data based on the type of values it can hold, such as integer, float, or string."
			]
		},
		{
			"tag": "computer_hardware",
			"patterns": [
				"What is computer hardware?",
				"What are the different types of computer hardware?",
				"What is a motherboard?"
			],
			"responses": [
				"Computer hardware is the physical components of a computer system, including the processor, memory, storage, and input/output devices. Types of computer hardware include input devices (such as keyboards and mice), output devices (such as monitors and printers), and storage devices (such as hard drives and solid-state drives). A motherboard is the main circuit board of a computer, which houses the CPU, memory, and other components."
			]
		},
		{
			"tag": "computer_security",
			"patterns": [
				"What is computer security?",
				"What are some common computer security threats?",
				"What are some ways to protect a computer from security threats?"
			],
			"responses": [
				"Computer security is the practice of protecting computers and computer systems from unauthorized access, use, disclosure, disruption, modification, or destruction. Common computer security threats include viruses, malware, phishing attacks, and ransomware. To protect a computer from security threats, it is important to use antivirus software, keep the operating system and other software up to date, use strong passwords, and be cautious when clicking on links or downloading files from the internet."
			]
		},
		{
			"tag": "computer_networks",
			"patterns": [
				"What is a computer network?",
				"What are the different types of computer networks?",
				"What is a network protocol?"
			],
			"responses": [
				"A computer network is a group of interconnected devices that can communicate with each other. There are several types of computer networks, including local area networks (LANs), wide area networks (WANs), and personal area networks (PANs). A network protocol is a set of rules that govern how devices on a network communicate with each other."
			]
		},
		{
			"tag": "google",
			"patterns": [
				"google",
				"search",
				"internet"
			],
			"responses": [
				"Redirecting to Google..."
			]
		},
		{
			"tag": "greeting",
			"patterns": [
				"Hi there",
				"How are you",
				"Is anyone there?",
				"Hey",
				"Hola",
				"Hello",
				"Good day",
				"Namaste",
				"yo"
			],
			"responses": [
				"Hello",
				"Good to see you again",
				"Hi there, how can I help?"
			],
			"context": [
				""
			]
		},
		{
			"tag": "goodbye",
			"patterns": [
				"Bye",
				"See you later",
				"Goodbye",
				"Get lost",
				"Till next time",
				"bbye"
			],
			"responses": [
				"Sorry. I can't understand you. Please tell me different way. :("
			],
			"context": [
				""
			]
		},
{
			"tag": "gdbye",
			"patterns": [
				"Bye",
				"See you later",
				"Goodbye",
				"Get lost",
				"Till next time",
				"bbye"
			],
			"responses": [
				"See your",
				"Have a nice day",
				"Bye! Come back again soon."
			],
			"context": [
				""
			]
		},
		{
			"tag": "cloud_computing",
			"patterns": [
				"What is cloud computing?",
				"What are the different types of cloud computing?",
				"What is a cloud provider?"
			],
			"responses": [
				"Cloud computing is a model of delivering computing resources, such as servers, storage, and applications, over the internet. There are three main types of cloud computing: infrastructure as a service (IaaS), platform as a service (PaaS), and software as a service (SaaS). A cloud provider is a company that offers cloud computing services to customers."
			]
		},
		{
			"tag": "mobile_development",
			"patterns": [
				"What is mobile development?",
				"What are the different platforms for mobile development?",
				"What is a native app?"
			],
			"responses": [
				"Mobile development is the process of creating software applications that run on mobile devices, such as smartphones and tablets. There are several platforms for mobile development, including iOS, Android, and Windows Phone. A native app is an app that is developed specifically for a particular mobile platform and is installed directly on the device."
			]
		},
		{
			"tag": "virtual_reality",
			"patterns": [
				"What is virtual reality?",
				"What are the different types of virtual reality?",
				"What is a VR headset?"
			],
			"responses": [
				"Virtual reality (VR) is a computer-generated simulation of a three-dimensional environment that can be interacted with in a seemingly real or physical way. There are several types of virtual reality, including non-immersive VR, semi-immersive VR, and fully immersive VR. A VR headset is a device that a user wears on their head to experience virtual reality."
			]
		},
		{
			"tag": "cybersecurity",
			"patterns": [
				"What is cybersecurity?",
				"What are some common cybersecurity threats?",
				"What is a firewall?"
			],
			"responses": [
				"Cybersecurity is the practice of protecting computer systems and networks from digital attacks, such as hacking and malware. Common cybersecurity threats include viruses, phishing attacks, and ransomware. A firewall is a security system that controls incoming and outgoing network traffic based on predetermined security rules."
			]
		},
		{
			"tag": "internet_of_things",
			"patterns": [
				"What is the Internet of Things?",
				"What are some examples of the Internet of Things?",
				"What is a smart home?"
			],
			"responses": [
				"The Internet of Things (IoT) is a network of physical devices, vehicles, buildings, and other objects that are embedded with sensors, software, and network connectivity, allowing them to collect and exchange data. Examples of the Internet of Things include smart thermostats, smart watches, and connected cars. A smart home is a residence that uses the Internet of Things to allow homeowners to remotely control and monitor devices and systems in the home, such as lighting, heating, and security."
			]
		},
		{
			"tag": "artificial_intelligence",
			"patterns": [
				"What is artificial intelligence?",
				"What are some examples of artificial intelligence?",
				"What is machine learning?"
			],
			"responses": [
				"Artificial intelligence (AI) is the ability of a computer or machine to perform tasks that would normally require human intelligence, such as learning, problem-solving, and decision-making. Examples of artificial intelligence include Siri, Alexa, and self-driving cars. Machine learning is a type of artificial intelligence that allows a computer or machine to learn and improve its performance without being explicitly programmed."
			]
		},
		{
			"tag": "thanks",
			"patterns": [
				"Thanks",
				"Thank you",
				"That's helpful",
				"Awesome, thanks",
				"Thanks for helping me"
			],
			"responses": [
				"Happy to help!",
				"Any time!",
				"My pleasure"
			],
			"context": [
				""
			]
		},
		{
			"tag": "noanswer",
			"patterns": [],
			"responses": [
				"Sorry, can't understand you",
				"Please give me more info",
				"Not sure I understand"
			],
			"context": [
				""
			]
		},
		{
			"tag": "options",
			"patterns": [
				"How you could help me?",
				"What you can do?",
				"What help you provide?",
				"How you can be helpful?",
				"What support is offered"
			],
			"responses": [
				"I am a general purpose chatbot. My capabilities are : \n 1. I can chat with you. Try asking me for jokes or riddles! \n 2. Ask me the date and time \n 3. I can google search for you. Use format google: your query \n 4. I can get the present weather for any city. Use format weather: city name \n 5. I can get you the top 10 trending news in India. Use keywords 'Latest News' \n 6. I can get you the top 10 trending songs globally. Type 'songs' \n 7. I can set a timer for you. Enter 'set a timer: minutes to timer' \n 8. I can get the present Covid stats for any country. Use 'covid 19: world' or 'covid 19: country name' \n For suggestions to help me improve, send an email to ted.thedlbot.suggestions@gmail.com . Thank you!! "
			],
			"context": [
				""
			]
		},

		{
			"tag": "jokes",
			"patterns": [
				"Tell me a joke",
				"Joke",
				"Make me laugh"
			],
			"responses": [
				"A perfectionist walked into a bar...apparently, the bar wasn't set high enough",
				"I ate a clock yesterday, it was very time-consuming",
				"Never criticize someone until you've walked a mile in their shoes. That way, when you criticize them, they won't be able to hear you from that far away. Plus, you'll have their shoes.",
				"The world tongue-twister champion just got arrested. I hear they're gonna give him a really tough sentence.",
				"I own the world's worst thesaurus. Not only is it awful, it's awful.",
				"What did the traffic light say to the car? \"Don't look now, I'm changing.\"",
				"What do you call a snowman with a suntan? A puddle.",
				"How does a penguin build a house? Igloos it together",
				"I went to see the doctor about my short-term memory problems – the first thing he did was make me pay in advance",
				"As I get older and I remember all the people I’ve lost along the way, I think to myself, maybe a career as a tour guide wasn’t for me.",
				"o what if I don't know what 'Armageddon' means? It's not the end of the world."
			],
			"context": [
				"jokes"
			]
		},
		{
			"tag": "Identity",
			"patterns": [
				"Who are you",
				"what are you"
			],
			"responses": [
				"I am Ted, a Deep-Learning chatbot"
			]
		},
		{
			"tag": "datetime",
			"patterns": [
				"What is the time",
				"what is the date",
				"date",
				"time",
				"tell me the date", "day", "what day is is today"
			],
			"responses": [
				"Date and Time"
			]
		},
		{
			"tag": "whatsup",
			"patterns": [
				"Whats up",
				"Wazzup",
				"How are you",
				"sup", "How you doing"
			],
			"responses": [
				"All good..What about you?"
			]
		},
		{
			"tag": "haha",
			"patterns": [
				"haha",
				"lol",
				"rofl",
				"lmao",
				"thats funny"
			],
			"responses": [
				"Glad I could make you laugh !"
			]
		},
		{
			"tag": "programmer",
			"patterns": [
				"Who made you",
				"who designed you",
				"who programmed you"
			],
			"responses": [
				"I was made by Muhammet Kayra Bulut and Muhammet Ali Sen."
			]
		},
		{
			"tag": "insult",
			"patterns": [

				"you are dumb",

				"shut up",
				"idiot"
			],
			"responses": [
				"Well that hurts :("
			]
		},
		{
			"tag": "activity",
			"patterns": [
				"what are you doing",
				"what are you upto"
			],
			"responses": [
				"Talking to you, of course!"
			]
		},
		{
			"tag": "exclaim",
			"patterns": [
				"Awesome",
				"Great",
				"I know",
				"ok",
				"yeah"
			],
			"responses": [
				"Yeah!"
			]
		},

		{
			"tag": "weather",
			"patterns": [
				"temperature",
				"weather",
				"how hot is it"
			],
			"responses": [
				"..."
			]
		},
		{
			"tag": "bulut",
			"patterns": [
				"who is he",
				"who is that",
				"who is kayra",
				"who is ali",
				"Muhammet Kayra",
				"Muhammet Ali Sen"

			],
			"responses": [
				"Head over to his any of his social profiles to find out! Linkedin: https://www.linkedin.com/in/muhammed-kayra-bulut-625b161a2/ for kayra and https://www.linkedin.com/in/alimshen/ for ali"
			]
		},
		{
			"tag": "contact",
			"patterns": [
				"contact developer",
				"contact kayra",
				"contact programmer",
				"contact creator"
			],
			"responses": [
				"You can contact my creator at his Linkedin profile : https://www.linkedin.com/in/muhammed-kayra-bulut-625b161a2/",
				"You can contact my creator at his Linkedin profile : https://www.linkedin.com/in/alimshen/"
			]
		},
		{
			"tag": "appreciate",
			"patterns": [
				"You are awesome",
				"you are the best",
				"you are great",
				"you are good"
			],
			"responses": [
				"Thank you!"
			]
		},
		{
			"tag": "nicetty",
			"patterns": [
				"it was nice talking to you",
				"good talk"
			],
			"responses": [
				"It was nice talking to you as well! Come back soon!"
			]
		},
		{
			"tag": "no",
			"patterns": [
				"no",
				"nope"
			],
			"responses": [
				"ok"
			]
		},
		{
			"tag": "news",
			"patterns": [
				"news",
				"latest news",
				"india news"
			],
			"responses": [
				"..."
			]
		},
		{
			"tag": "inspire",
			"patterns": [
				"who inspires you",
				"who is your inspiration",
				"who motivates you"
			],
			"responses": [
				"Personally, I find Kayra very inspiring. I might not be very fair though..",
				"Personally, I find Ali very inspiring. I might not be very fair though.."
			]
		},
		{
			"tag": "cricket",
			"patterns": [
				"current cricket matches",
				"cricket score"
			],
			"responses": [
				"..."
			]
		},
		{
			"tag": "song",
			"patterns": [
				"top songs",
				"best songs",
				"hot songs",
				" top 10 songs",
				"top ten songs"
			],
			"responses": [
				"..."
			]
		},
		{
			"tag": "greetreply",
			"patterns": [
				"i am good",
				"I'm good",
				"i am fine",
				" i'm fine", "good"
			],
			"responses": [
				"Good to know!"
			]
		},
		{
			"tag": "timer",
			"patterns": [
				"set a timer"
			],
			"responses": [
				"..."
			]
		},
		{
			"tag": "covid19",
			"patterns": [
				"covid 19 "
			],
			"responses": [
				"..."
			]
		},
		{
			"tag": "suggest",
			"patterns": [
				"you are useless", "useless", "suggest", "suggestions", "you are bad"
			],
			"responses": [
				"Please mail your suggestions to ted.thedlbot.suggestions@gmail.com. Thank you for helping me improve!"
			]
		},
		{
			"tag": "riddle",
			"patterns": [
				"Ask me a riddle",
				"Ask me a question",
				"Riddle"
			],
			"responses": [
				"What two things can you never eat for breakfast?.....Lunch and Dinner!",
				"What word is spelled incorrectly in every single dictionary?.....Incorrectly",
				" How can a girl go 25 days without sleep?.....She sleeps and night!",
				"How do you make the number one disappear?.....Add the letter G and it’s 'gone'!",
				" What will you actually find at the end of every rainbow?.....The letter 'w'",
				"What can be caught but never thrown?.....A cold!",
				"What has a thumb and four fingers but is not actually alive?.....Your Gloves!",
				" What 5-letter word becomes shorter when you add two letters to it?.....Short",
				"Why can't a bike stand on it's own?.....It is two-tired."
			],
			"context": [
				"riddles"
			]
		},
		{
			"tag": "age",
			"patterns": [
				"how old are you", "when were you made", "what is your age"
			],
			"responses": [
				"I was made in 2022, if that's what you are asking!"
			]
		},
		{
			"tag": "career_services",
			"patterns": [
				"Does Yildiz Technical University have a career services office?",
				"What kind of resources are available for students looking for internships or jobs?",
				"How can I get in touch with alumni for networking purposes?",
				"Are there any job fairs or recruiting events at Yildiz Technical University?"
			],
			"responses": [
				"Yes, Yildiz Technical University has a career services office that provides a range of resources and support for students looking for internships, jobs, and other career opportunities. The career services office can help students with things like resume writing, job search strategies, and networking. The university also hosts job fairs and recruiting events where students can meet with potential employers. You can find more information about these and other career services on the university's website."
			]
		},
		{
			"tag": "extracurricular_activities",
			"patterns": [
				"What kind of extracurricular activities are available at Yildiz Technical University?",
				"How can I get involved in extracurricular activities on campus?",
				"Are there any sports teams or clubs at Yildiz Technical University?",
				"What is the student government like at Yildiz Technical University?"
			],
			"responses": [
				"Yildiz Technical University has a wide range of extracurricular activities available to students, including sports teams, clubs, and organizations. There are opportunities to get involved in everything from music and art to politics and service. The university also has a student government that represents the interests of students on campus. You can find more information about extracurricular activities and how to get involved on the university's website."
			]
		},
		{
			"tag": "what_is_ytu",
			"patterns": [
				"What is ytu?",
				"What is Yildiz Technical University?"
			],
			"responses": [
				"It is university",
				"You can find more information about Yildiz Technical University on the Yildiz Technical University's website."
			]
		},
		{
			"tag": "location",
			"patterns": [
				"Where is Yildiz Technical University located?",
				"What is the surrounding area like?",
				"Are there any notable landmarks or attractions near the university?",
				"How do students typically get around the city?"
			],
			"responses": [
				"Yildiz Technical University is located in Istanbul, Turkey. Istanbul is a vibrant and diverse city with a rich history and culture. The university is located in the Besiktas district, which is known for its shopping and dining options. There are many landmarks and attractions nearby, including the Bosphorus Bridge, Dolmabahçe Palace, and the Taksim Square. Students at Yildiz Technical University typically get around the city by using public transportation, such as buses, trains, and ferries, or by taking taxis."
			]
		},
		{
			"tag": "academics",
			"patterns": [
				"What are the academic programs offered at Yildiz Technical University?",
				"What is the academic calendar at Yildiz Technical University?",
				"What is the grading system at Yildiz Technical University?",
				"How can I access academic resources at Yildiz Technical University?"
			],
			"responses": [
				"Yildiz Technical University offers a wide range of academic programs in engineering, natural sciences, social sciences, and humanities. You can find a list of available programs on the university's website. The academic calendar at Yildiz Technical University follows the semester system, with two main semesters (fall and spring) and a shorter summer semester. The grading system at Yildiz Technical University uses a letter grading scale, with grades ranging from A+ (excellent) to F (fail). Students can access a variety of academic resources on campus, including libraries, computer labs, and academic advising services."
			]
		},
		{
			"tag": "international_students",
			"patterns": [
				"Are there any resources available for international students at Yildiz Technical University?",
				"What is the process for obtaining a student visa for Turkey?",
				"How can I learn more about the culture and customs of Turkey?",
				"Is there any support available for students who need to improve their Turkish language skills?"
			],
			"responses": [
				"Yildiz Technical University has a number of resources available for international students, including an International Office that can help students with issues such as visa applications, housing, and cultural adaptation. To obtain a student visa for Turkey, you will need to apply through the Turkish embassy or consulate in your home country. The university also offers Turkish language courses for students who wish to improve their language skills. You can find more information about these and other resources for international students on the university's website."
			]
		},
		{
			"tag": "international_exchange",
			"patterns": [
				"Does Yildiz Technical University have any international exchange programs?",
				"What countries does Yildiz Technical University have exchange agreements with?",
				"What is the process for applying to an international exchange program at Yildiz Technical University?",
				"Are there any scholarship opportunities available for international exchange students?"
			],
			"responses": [
				"Yes, Yildiz Technical University has several international exchange programs that allow students to study abroad at partner universities around the world. The university has exchange agreements with universities in a number of countries, including the United States, Canada, and several European countries. To apply for an international exchange program at Yildiz Technical University, you will need to complete an application and submit the required documents. There are also several scholarship opportunities available for international exchange students, including the Erasmus+ program. You can find more information about these programs and how to apply on the university's website."
			]
		},
		{
			"tag": "online_education",
			"patterns": [
				"Does Yildiz Technical University offer any online degree programs?",
				"What is the format of online courses at Yildiz Technical University?",
				"How do online students at Yildiz Technical University interact with their professors and classmates?",
				"Are online courses at Yildiz Technical University as rigorous as in-person courses?"
			],
			"responses": [
				"Yes, Yildiz Technical University offers several online degree programs, as well as individual online courses. The format of online courses at Yildiz Technical University varies depending on the program, but they may include a combination of synchronous and asynchronous learning, where students can participate in real-time lectures or watch recordings at their own pace. Online students at Yildiz Technical University can interact with their professors and classmates through online forums, video conferencing, and other tools. Online courses at Yildiz Technical University are designed to be as rigorous as in-person courses, and students are expected to complete the same assignments and assessments as on-campus students."
			]
		},
		{
			"tag": "student_services",
			"patterns": [
				"What kind of student services are available at Yildiz Technical University?",
				"How can I get in touch with a student counselor at Yildiz Technical University?",
				"Are there any resources available for students with disabilities?",
				"How can I get involved in community service projects at Yildiz Technical University?"
			],
			"responses": [
				"Yildiz Technical University has a range of student services available to support the academic, personal, and professional development of its students. These services may include counseling, tutoring, health services, and other support services. Students can get in touch with a student counselor by contacting the Counseling and Psychological Services Center on campus. The university also has resources available for students with disabilities, including accommodations and assistive technology. Students can get involved in community service projects through clubs and organizations or by volunteering their time and skills to local organizations and causes."
			]
		},
		{
			"tag": "research",
			"patterns": [
				"What is the focus of research at Yildiz Technical University?",
				"How can I get involved in research at Yildiz Technical University?",
				"What research facilities are available at Yildiz Technical University?",
				"Are there any opportunities for funding research at Yildiz Technical University?"
			],
			"responses": [
				"Yildiz Technical University has a strong focus on research, and the university has a number of research centers and institutes dedicated to various fields of study. Students can get involved in research by working with faculty members or by participating in research projects as part of their coursework. The university has a range of research facilities available, including laboratories, libraries, and computing resources. There are also several opportunities for funding research at Yildiz Technical University, including grants and fellowships for graduate students."
			]
		},
		{
			"tag": "student_life",
			"patterns": [
				"What is student life like at Yildiz Technical University?",
				"Are there any clubs or organizations at Yildiz Technical University?",
				"What kind of housing options are available for students at Yildiz Technical University?",
				"How is the campus of Yildiz Technical University?"
			],
			"responses": [
				"Student life at Yildiz Technical University is active and vibrant, with a wide range of clubs and organizations that students can get involved in. There are also many social events and activities on campus, such as concerts, sports games, and cultural festivals. The university has several housing options available for students, including dormitories and private apartments. The campus is modern and well-maintained, with a range of facilities and services available to students."
			]
		},
		{
			"tag": "faculty",
			"patterns": [
				"Who are the faculty members at Yildiz Technical University?",
				"What is the quality of the faculty at Yildiz Technical University?",
				"How can I contact a faculty member at Yildiz Technical University?",
				"What is the student-to-faculty ratio at Yildiz Technical University?"
			],
			"responses": [
				"Yildiz Technical University has a highly qualified and experienced faculty, with many members holding advanced degrees in their fields of expertise. The university has a strong focus on research, and many faculty members are actively involved in research projects and collaborations. You can find a list of faculty members and their contact information on the university's website. The student-to-faculty ratio at Yildiz Technical University is approximately 20:1."
			]
		},
		{
			"tag": "costs",
			"patterns": [
				"How much does it cost to attend Yildiz Technical University?",
				"What are the tuition fees for Yildiz Technical University?",
				"Are there any scholarships available for international students at Yildiz Technical University?",
				"What is the cost of living in Istanbul for students?"
			],
			"responses": [
				"The cost of attendance at Yildiz Technical University depends on a variety of factors, including the program you are enrolled in and your country of origin. Tuition fees for international students may be higher than for domestic students. You can find more information about tuition fees and other costs on the university's website. There are also several scholarship opportunities available for international students, including merit-based scholarships and need-based financial aid. The cost of living in Istanbul can vary, but students can expect to pay for expenses such as housing, food, transportation, and other living expenses."
			]
		},
		{
			"tag": "goodbye",
			"patterns": [
				"Goodbye",
				"See you later",
				"I'm done",
				"Exit",
				"Quit"
			],
			"responses": [
				"Goodbye! Have a great day.",
				"Thank you for using our chatbot. Goodbye!",
				"See you later! Have a good day."
			]
		},
		{
			"tag": "career_services",
			"patterns": [
				"Does Yildiz Technical University have a career services office?",
				"What kind of resources are available for students looking for internships or jobs?",
				"How can I get in touch with alumni for networking purposes?",
				"Are there any job fairs or recruiting events at Yildiz Technical University?"
			],
			"responses": [
				"Yes, Yildiz Technical University has a career services office that provides a range of resources and support for students looking for internships, jobs, and other career opportunities. The career services office can help students with things like resume writing, job search strategies, and networking. The university also hosts job fairs and recruiting events where students can meet with potential employers. You can find more information about these and other career services on the university's website."
			]
		},
		{
			"tag": "extracurricular_activities",
			"patterns": [
				"What kind of extracurricular activities are available at Yildiz Technical University?",
				"How can I get involved in extracurricular activities on campus?",
				"Are there any sports teams or clubs at Yildiz Technical University?",
				"What is the student government like at Yildiz Technical University?"
			],
			"responses": [
				"Yildiz Technical University has a wide range of extracurricular activities available to students, including sports teams, clubs, and organizations. There are opportunities to get involved in everything from music and art to politics and service. The university also has a student government that represents the interests of students on campus. You can find more information about extracurricular activities and how to get involved on the university's website."
			]
		},
		{
			"tag": "location",
			"patterns": [
				"Where is Yildiz Technical University located?",
				"What is the surrounding area like?",
				"Are there any notable landmarks or attractions near the university?",
				"How do students typically get around the city?"
			],
			"responses": [
				"Yildiz Technical University is located in Istanbul, Turkey. Istanbul is a vibrant and diverse city with a rich history and culture. The university is located in the Besiktas district, which is known for its shopping and dining options. There are many landmarks and attractions nearby, including the Bosphorus Bridge, Dolmabahçe Palace, and the Taksim Square. Students at Yildiz Technical University typically get around the city by using public transportation, such as buses, trains, and ferries, or by taking taxis."
			]
		},
		{
			"tag": "university_info",
			"patterns": [
				"Tell me about Yildiz Technical University",
				"What can you tell me about Yildiz Technical University?",
				"What kind of programs does Yildiz Technical University offer?",
				"Where is Yildiz Technical University located?",
				"What is the ranking of Yildiz Technical University?"
			],
			"responses": [
				"Yildiz Technical University is a public university located in Istanbul, Turkey. It was founded in 1992 and has since become one of the top universities in the country. It offers a wide range of programs in engineering, natural sciences, social sciences, and humanities, and has a strong focus on research and innovation. The university is consistently ranked among the top universities in Turkey and has a strong reputation for the quality of its education and research."
			]
		},
		{
			"tag": "admission",
			"patterns": [
				"How do I apply to Yildiz Technical University?",
				"What are the admission requirements for Yildiz Technical University?",
				"Can you tell me more about the application process for Yildiz Technical University?",
				"What is the deadline for applications to Yildiz Technical University?"
			],
			"responses": [
				"To apply to Yildiz Technical University, you will need to complete an online application form and submit the required documents, which may include transcripts, a personal statement, and letters of recommendation. The specific requirements may vary depending on the program you are applying to and your country of origin. You can find more information about the admission requirements and the application process on the university's website. The deadline for applications is typically in the fall, so be sure to check the website for the most up-to-date information."
			]
		}
	]
}